import PageHeadTitle from "components/atoms/PageHeadTitle";
import Layout from "components/templates/Layout";
import { cx } from "helpers/utils";
import { ILocaleProps } from "interfaces/general";

const TermOfUsePage = () => {
  return (
    <Layout>
      <div>
        <PageHeadTitle title='นโยบายคุ้มครองข้อมูลส่วนบุคคล' />
        <div
          className={cx(
            "container rounded-3xl w-[350px] bg-white text-subtitle2 text-gray-400",
            "py-5 px-5 mt-[40px] mb-[100px]",
            "tablet:max-w-[1200px] tablet:w-[calc(100%-64px)]",
            "laptop:max-w-[1200px]",
            "laptop:py-14 laptop:px-20 laptop:mt-[100px]"
          )}
        >
          <div>
            เว็บไซต์{" "}
            <span className='text-green-100'>
              www.investree.co.th (Investree)
            </span>{" "}
            ดำเนินการโดย อินเวสทรี (ไทยแลนด์) จำกัด ซึ่งเป็น บริษัท
            ที่จดทะเบียนในประเทศไทยซึ่งมีสำนักงานจดทะเบียน
            และที่ตั้งสำนักงานใหญ่อยู่ที่ชั้น 12 ห้อง B อาคารเลครัชดา ออฟฟิส
            คอมเพล็กซ์ เลขที่ 195/13 ถนนรัชดาภิเษก เขตคลองเตย กรุงเทพฯ 10110
            ซึ่งต่อไปในข้อตกลงนี้ เรียกว่า “บริษัทฯ”
            และข้อกำหนดและเงื่อนไขการใช้งาน (ข้อตกลง)
            นี้มีผลบังคับใช้กับท่านในฐานะผู้ใช้ของเว็บไซต์และ Investree
            รวมถึงผลิตภัณฑ์ บริการเครื่องมือ และข้อมูลที่มีอยู่บนเว็บไซต์
          </div>
          <div className='mt-4 laptop:mt-[25px]'>
            โปรดอ่านข้อกำหนดเหล่านี้อย่างรอบคอบก่อนที่จะใช้เว็บไซต์นี้
            โดยการใช้เว็บไซต์นี้ไม่ว่าในกรณีใดท่านยอมรับว่า: (i)
            ท่านได้อ่านและทำความคุ้นเคยกับข้อกำหนดเหล่านี้ (ii)
            ท่านเข้าใจข้อกำหนดเหล่านี้ และ (iii)
            ท่านตกลงที่จะยอมรับข้อกำหนดเหล่านี้ เมื่อใช้งานเว็บไซต์
            หากท่านไม่เห็นด้วยกับข้อกำหนดเหล่านี้ท่านควรหยุดใช้งานเว็บไซต์นี้ทันที
          </div>
          <div className='mt-4 laptop:mt-[25px]'>
            บริษัทฯ
            ขอสงวนสิทธิ์ในการปรับเปลี่ยนหรือแก้ไขข้อกำหนดเหล่านี้บนเว็บไซต์
            รูปแบบและหรือเนื้อหาใด ๆ บนเว็บไซต์เป็นครั้งคราว เพื่อความปลอดภัย
            เพื่อให้เป็นไปตามกฎหมาย เกณฑ์หรือข้อบังคับที่อาจเกี่ยวข้อง
            หรือเพื่อสะท้อนถึงการปรับปรุงหรือเปลี่ยนแปลง
            การให้บริการหรือฟังก์ชั่นของเว็บไซต์ บริษัทฯ
            แนะนำให้ท่านทำการตรวจสอบข้อกำหนดเหล่า
            นี้เป็นระยะเพื่อให้แน่ใจว่าท่านรับทราบและปฏิบัติตามข้อกำหนดที่อาจได้รับการเปลี่ยนแปลงทั้งนี้การเปลี่ยนแปลงของข้อกำหนดและเว็บไซต์จะมีผลผูกพันกับท่านผู้เป็นผู้ใช้ของเว็บไซต์ทันที
            ทั้งนี้
            การที่ท่านใช้งานเว็บไซต์นี้ต่อไปจะถือว่าท่านยินดียอมรับการเปลี่ยนแปลงของข้อกำหนดและการเปลี่ยนแปลงของเว็บไซต์โดยปริยาย
          </div>
          <div className='mt-4 laptop:mt-[25px]'>
            บริษัทฯ จะทำการประกาศเกี่ยวกับการเปลี่ยนแปลงของข้อกำหนด
            และท่านยอมรับว่าว่าการทำเช่นนั้นทางบริษัทฯ
            ได้แจ้งให้ท่านทราบถึงการเปลี่ยนแปลงดังกล่าวอย่างเพียงพอ
          </div>
          <div className='mt-4 laptop:mt-[25px]'>
            หากท่านเลือกที่จะเป็นผู้เสนอขายหลักทรัพย์หรือนักลงทุนผ่านบริษัทฯท่านต้องยอมรับและปฏิบัติตามข้อกำหนดที่เกี่ยวกับการเป็นผู้เสนอขายหลักทรัพย์หรือข้อกำหนดของนักลงทุนของบริษัทฯตามที่บริษัทฯได้ประกาศบังคับใช้ท่านควรพิจารณาและอ่านข้อกำหนดเหล่านี้ควบคู่ไปกับข้อกำหนดที่เกี่ยวกับการเป็นผู้เสนอขายหลักทรัพย์หรือข้อกำหนดของนักลงทุนของบริษัทฯ
            ตามที่บริษัทฯ ได้ประกาศบังคับใช้
            เมื่อตอนที่ท่านลงทะเบียนเป็นผู้เสนอขายหลักทรัพย์หรือเป็นนักลงทุน
            รวมถึงนโยบายการรักษาข้อมูลของบริษัทฯ (Privacy Policy)
            (ท่านสามารถเข้ารับข้อมูลเพิ่มเติมได้ที่)
            https://www.investree.co.th/th/privacy-policy-new บริษัทฯ
          </div>
          <div className='mt-4 laptop:mt-[25px]'>
            ขอแนะนำให้ท่านขอคำแนะนำจากผู้เชี่ยวชาญเกี่ยวกับภาษีและข้อกำหนดทางกฎหมายที่ท่านต้องปฏิบัติตามในส่วนที่เกี่ยวข้องกับการเป็นนักลงทุนหรือผู้เสนอ
            ขายหลักทรัพย์ในบริษัทฯ
          </div>
          <ul className='list-decimal pl-5'>
            <li className='mt-8 laptop:mt-10 text-subtitle7 text-green-100'>
              ข้อสงวนสิทธิ์และคำเตือนเรื่องความเสี่ยง
              <div
                className={cx(
                  "text-gray-400 text-subtitle2",
                  "mt-4 laptop:mt-[14px]"
                )}
              >
                <span className='text-green-100'>1.1</span>{" "}
                บริการของบริษัทฯผ่านเว็บไซต์หรือapplicationเป็นแนวทางให้ท่านสามารถลงทุนโดยตรงในตราสารหลักทรัพย์จากบุคคลที่สามและหรือจัดหาเงินทุนโดยตรงจากบุคคล
                ที่สาม ทางบริษัทฯ ไม่ได้เป็นเจ้าของบริษัทที่เสนอขายหลักทรัพย์
                หรือเป็นเจ้าของโอกาสในการลงทุนที่แสดงบนเว็บไซต์เมื่อท่านตกลงที่จะลงทุนในตราสารหลักทรัพย์
                ของบริษัทใด ๆ หรือทำการเสนอขายหลักทรัพย์ให้นักลงทุน
                ธุรกรรมสัญญาดังกล่าวจะเป็นการเข้าทำสัญญาระหว่างผู้เสนอขายหลักทรัพย์และนักลงทุนโดยตรงไม่ได้เป็น
                การทำธุรกรรมสัญญากับ บริษัทฯ แต่อย่างใด
                การทำสัญญาระหว่างท่านและบุคคลที่สามถือเป็นความเสี่ยงและความรับผิดชอบของท่านแต่เพียงผู้เดียว
              </div>
              <div
                className={cx(
                  "text-gray-400 text-subtitle2",
                  "mt-4 laptop:mt-5"
                )}
              >
                <span className='text-green-100'>1.2</span>{" "}
                ท่านรับทราบและยอมรับว่าไม่มีเนื้อหาใดที่เผยแพร่บนเว็บไซต์ถือว่าเป็นคำแนะนำด้านการลงทุนจาก
                บริษัทฯ ทางบริษัทฯ ไม่ได้ทำการแนะนำว่าการลงทุนแบบไหนเหมาะสม
                กับท่าน
                ท่านเข้าใจเพิ่มเติมว่าบริษัทฯผู้ให้บริการข้อมูลใดบริษัทในเครือของบริษัทฯ
                จะไม่ทำการให้คำแนะนำด้านการลงทุน หรือให้คำแนะนำเกี่ยวกับลักษณะ
                ประสิทธิภาพ
                ความเหมาะสมของการลงทุนผลการดำเนินงานของการลงทุนหรือกลยุทธ์การลงทุนหรืออื่น
                ๆ แก่ท่านเป็นการส่วนตัว
              </div>
              <div
                className={cx(
                  "text-gray-400 text-subtitle2",
                  "mt-4 laptop:mt-5"
                )}
              >
                <span className='text-green-100'>1.3</span>{" "}
                เนื้อหาและข้อความใดที่มีอยู่บนเว็บไซต์นี้มีไว้เพื่อให้ข้อมูลเท่านั้น
                และไม่ได้มีวัตถุประสงค์เพื่อตอบสนองความต้องการเฉพาะของท่าน
                เนื้อหาและข้อความที่มีอยู่บนเว็บไซต์นั้น
                ไม่ใช่คำแนะนำด้านการลงทุนหรือเป็นการเสนอหรือชักชวนให้ท่านในการซื้อหรือขาย
                การลงทุนหรือบริการทางการเงินอื่น ๆ
                ท่านควรศึกษาข้อมูลก่อนการตัดสินใจใน
                การเสนอขายหลักทรัพย์หรือลงทุนด้วยตัวท่านเอง
                และไม่ควรพึ่งพาข้อมูลในเว็บไซต์เพื่อการลงทุนหรือไม่ลงทุนบริษัทฯ
                ขอแนะนำให้ท่านหาคำแนะนำด้านการลงทุนจากที่
                ปรึกษาทางการเงินก่อนการตัดสินใจใด ๆ
              </div>
              <div
                className={cx(
                  "text-gray-400 text-subtitle2",
                  "mt-4 laptop:mt-5"
                )}
              >
                <span className='text-green-100'>1.4</span>{" "}
                มูลค่าการลงทุนและรายได้ที่ท่านอาจได้รับอาจผันผวนและท่านอาจไม่ได้เงินต้นคืนจากการลงทุนของท่าน
                ผลการตอบแทนในอดีตไม่ได้รับประกันผลตอบแทนในอนาคต
                การลงทุนของท่านอาจไม่มีสภาพคล่องและอาจทำให้
                ท่านไม่สามารถทำการขายหรือประเมินราคาของการลงทุนของท่านได้
              </div>
              <div
                className={cx(
                  "text-gray-400 text-subtitle2",
                  "mt-4 laptop:mt-5"
                )}
              >
                <span className='text-green-100'>1.5</span>{" "}
                ท่านรับทราบและยอมรับว่าราคา คำอธิบาย และข้อมูลทางการเงินอื่น ๆ
                ที่อยู่บนเว็บไซต์หรือ application
                อื่นเป็นข้อมูลที่รวบรวมจากแหล่งข้อมูลบุคคลที่สามที่ทางบริษัทฯ
                เชื่อว่าเชื่อถือได้ และหากเป็นไปได้บริษัทฯ
                จะทำการตรวจสอบความถูกต้องของข้อมูลดังกล่าวเท่าที่จะทำได้ในเชิงพาณิชย์
                ท่านยอมรับและตกลงว่าบริษัทฯ เจ้าของข้อมูล บุคคลที่สาม
                หรือผู้เกี่ยวข้องกับบริษัทฯ
                ไม่อาจรับประกันความถูกต้องและความสมบูรณ์ของข้อมูล
              </div>
              <div
                className={cx(
                  "text-gray-400 text-subtitle2",
                  "mt-4 laptop:mt-5"
                )}
              >
                <span className='text-green-100'>1.6</span>{" "}
                ท่านรับทราบและยอมรับว่าอัตราดอกเบี้ยที่อยู่บนเว็บไซต์นั้นเป็นเพียงข้อมูลเบื้องต้นเท่านั้น
                และบริษัทฯ
                ไม่รับประกันว่าท่านจะมีโอกาสในการได้รับอัตราดอกเบี้ยดังกล่าว
              </div>
              <div
                className={cx(
                  "text-gray-400 text-subtitle2",
                  "mt-4 laptop:mt-5"
                )}
              >
                <span className='text-green-100'>1.7</span>{" "}
                เนื้อหาและข้อความที่มีอยู่บนเว็บไซต์นั้นไม่ใช่คำแนะนำด้านการลงทุน
                หรือเป็นการเสนอหรือชักชวนให้ท่านในการซื้อหรือขาย
                การลงทุนหรือบริการทางการเงินอื่น ๆ
                ในประเทศอื่นที่การลงทุนประเภทนี้ไม่ได้รับอนุญาตถูกต้องตามกฎหมาย
              </div>
              <div
                className={cx(
                  "text-gray-400 text-subtitle2",
                  "mt-4 laptop:mt-5"
                )}
              >
                <span className='text-green-100'>1.8</span> เว็บไซต์ของบริษัทฯ
                อาจมีการเผยแพร่สถิติข้อมูลการลงทุนในอดีตบางรายการ
                ซึ่งอาจเป็นการคัดเลือก ข้อมูลเพียงบางส่วน
                ความผันผวนของตลาดการเงิน
                และสภาพทางเศรษฐกิจอาจทำให้ข้อมูลในอดีตไม่มีความหมาย
                ซึ่งนักลงทุนไม่ควรพึ่งพาข้อมูลดังกล่าวในการตัดสินใจลงทุน
              </div>
            </li>
            <li className='mt-8 laptop:mt-10 text-subtitle7 text-green-100'>
              ความรับผิดชอบของบริษัทฯ
              <div
                className={cx(
                  "text-gray-400 text-subtitle2",
                  "mt-4 laptop:mt-[14px]"
                )}
              >
                <span className='text-green-100'>2.1</span> เว็บไซต์มีให้
                "ตามสภาพ" โดยบริษัทฯ บริษัทในเครือ ตัวแทนของบริษัทฯ
                และผู้ออกใบอนุญาตไม่รับประกันความถูกต้อง ความน่าเชื่อถือ คุณภาพ
                application อื่น นอกจากนี้ บริษัทฯ บริษัทในเครือ
                ตัวแทนของบริษัทฯ
                ไม่รับประกันว่าการบริการผ่านเว็บไซต์จะเป็นการให้บริการอย่างทันท่วงที
                ไม่ละเมิดสิทธิ และเหมาะสมสำหรับการค้า การพาณิชย์ และบริษัทฯ
                ปฏิเสธการรับประกันใด ๆ
                โดยชัดแจ้งหรือโดยนัยยกเว้นที่ไม่สามารถยกเว้นได้ตามกฎหมายที่เกี่ยวข้อง
              </div>
              <div
                className={cx(
                  "text-gray-400 text-subtitle2",
                  "mt-4 laptop:mt-5"
                )}
              >
                <span className='text-green-100'>2.2</span>{" "}
                แม้ว่าบริษัทฯจะพยายามทุกวิถีทางเพื่อให้มั่นใจว่าการให้บริการบนเว็บไซต์นั้นจะสามารถดำเนินการได้
                อย่างไม่ขัดข้อง แต่โดยลักษณะของการใช้บริการผ่านระบบ
                อินเทอร์เน็ตนั้นหมายความว่าบริษัทฯ
                ไม่สามารถรับประกันความพร้อมใช้งานของเว็บไซต์ได้
                บริษัทฯไม่รับประกันว่าบทบัญญัติของเว็บไซต์หรือส่วนใดส่วนหนึ่งของมันจะ
                สามารถใช้ได้อย่างต่อเนื่องหรือปราศจากข้อผิดพลาด
                ข้อบกพร่องในเว็บไซต์อาจจะไม่ได้รับการแก้ไขหรือว่าเว็บไซต์จะปลอดจาก
                ไวรัสหรือส่วนประกอบที่เป็นอันตรายอื่น ๆ บริษัทฯ
                จะไม่รับผิดชอบต่อการสูญเสีย
                ความเสียหายค่าใช้จ่ายความล่าช้าหรือความรับผิดอื่นใด
                (รวมถึงการสูญเสียทางการเงิน) ซึ่งอาจเกิดจากการไม่สามารถเข้า
                ใช้งานเว็บไซต์ได้ด้วยเหตุผลใดก็ตาม
              </div>
              <div
                className={cx(
                  "text-gray-400 text-subtitle2",
                  "mt-4 laptop:mt-5"
                )}
              >
                <span className='text-green-100'>2.3</span>{" "}
                ท่านเป็นผู้รับผิดชอบการเข้าถึงเว็บไซต์และ application
                อื่นผ่านระบบสื่อสารโทรคมนาคมอื่นแต่เพียงผู้เดียว
                ซึ่งรวมถึงค่าบริการหรือค่าธรรมเนียมใด ๆ
                เกี่ยวกับระบบสื่อสารโทรคมนาคม (เช่นค่าบริการอินเทอร์เน็ตหรือค่า
                data)
                ในทำนองเดียวกันท่านเป็นผู้รับผิดชอบแต่เพียงผู้เดียวสำหรับอุปกรณ์ทั้งหมด
                และการบำรุงรักษาซอฟต์แวร์ป้องกันไวรัสที่จำ
                เป็นสำหรับท่านในการเข้าถึงเว็บไซต์และ application อื่นของบริษัทฯ
              </div>
              <div
                className={cx(
                  "text-gray-400 text-subtitle2",
                  "mt-4 laptop:mt-5"
                )}
              >
                <span className='text-green-100'>2.4</span>{" "}
                ข้อมูลที่ส่งผ่านเว็บไซต์จะเป็นการผ่านระบบเครือข่ายโทรคมนาคมสาธารณะ
                ซึ่งบริษัทฯ จะไม่รับผิดชอบหากการสื่อสารดังกล่าวมีการรั่วไหล
                ถูกขัดขวางโดยบุคคลที่สาม ไม่เอื้อต่อการส่งข้อมูล
                หรือมีการส่งข้อมูลผิดพลาด
              </div>
            </li>
            <li className='mt-8 laptop:mt-10 text-subtitle7 text-green-100'>
              ความขัดแย้งทางผลประโยชน์
              <div
                className={cx(
                  "text-gray-400 text-subtitle2",
                  "mt-4 laptop:mt-[14px]"
                )}
              >
                ท่านรับทราบและยอมรับว่าบริษัทฯ บริษัทในเครือ
                เจ้าหน้าที่พนักงานหรือบุคคลอื่น ๆ
                ที่เกี่ยวข้องกับบริษัทฯอาจมีความสัมพันธ์กับการลงทุน
                หรือธุรกรรมที่ท่านผ่านเว็บไซต์
                ซึ่งอาจก่อให้เกิดความขัดแย้งทางผลประโยชน์ได้
                ท่านยินยอมที่จะไม่บังคับให้บริษัทฯ
                เปิดเผยข้อมูลเกี่ยวกับความขัดแย้งทางผลประโยชน์ดังกล่าวกับท่านและท่านยอมรับ
                ว่าบริษัทไม่มีภาระที่จะชี้แจงเกี่ยวกับ เรื่องดังกล่าวต่อท่าน
                เว้นแต่ได้รับคำสั่งศาลหรือเพื่อเป็นไปตามกฎหมายที่เกี่ยวข้อง
                การให้บริการผ่านทางเว็บไซต์ของบริษัทฯ นั้นเป็น
                การให้บริการที่อิสระ และปราศจากผลประโยชน์
                และความสัมพันธ์ดังกล่าว
              </div>
            </li>
            <li className='mt-8 laptop:mt-10 text-subtitle7 text-green-100'>
              วิธีการเข้าถึงบริการ
              <div
                className={cx(
                  "text-gray-400 text-subtitle2",
                  "mt-4 laptop:mt-[14px]"
                )}
              >
                <span className='text-green-100'>4.1</span> เว็บไซต์ของบริษัท
                ได้รับการออกแบบเพื่อดูผ่านเว็บไซต์ที่มีความละเอียดหน้าจอ 1024 x
                768 พิกเซล หรือสูงกว่า
                แม้ว่าท่านอาจใช้วิธีการอื่นในการเข้าถึงเว็บไซต์แต่โปรด
                ทราบว่าเว็บไซต์อาจไม่ปรากฏอย่างถูกต้องผ่านวิธีการเข้าถึงอื่น ๆ
              </div>
              <div
                className={cx(
                  "text-gray-400 text-subtitle2",
                  "mt-4 laptop:mt-5"
                )}
              >
                <span className='text-green-100'>4.2</span>{" "}
                ท่านห้ามเข้าใช้เว็บไซต์ผ่านอุปกรณ์หรือบริการที่ออกแบบมาเพื่อให้การเข้าถึงด้วยความเร็วสูง
                หรือการเข้าถึงแบบอัตโนมัติโดยวิธี automate และวิธีการเข้าแบบซ้ำ
                ๆ
              </div>
              <div
                className={cx(
                  "text-gray-400 text-subtitle2",
                  "mt-4 laptop:mt-5"
                )}
              >
                <span className='text-green-100'>4.3</span>{" "}
                การเข้าถึงบางส่วนของไซต์ได้นั้นสามารถเข้าถึงได้ด้วยรหัสผ่าน
                ท่านห้ามพยายามที่จะเข้าถึงส่วนดังกล่าวของเว็บไซต์หากท่านไม่ได้รับอนุญาตด้วยผ่านวิธีการใดๆ
              </div>
            </li>
            <li className='mt-8 laptop:mt-10 text-subtitle7 text-green-100'>
              คุณสมบัติและการลงทะเบียน
              <div
                className={cx(
                  "text-gray-400 text-subtitle2",
                  "mt-4 laptop:mt-[14px]"
                )}
              >
                <span className='text-green-100'>5.1</span>{" "}
                ในการเข้าใช้งานเว็บไซต์นั้นท่านต้องมีอายุอย่างน้อยยี่สิบ (20) ปี
                (วัดตามปฏิทินเกรกอเรียน)
                และมีความสามารถเข้าใช้บริการได้ตามกฎหมาย ท่านรับรองและรับประกัน
                ว่าท่านมีสิทธิ์ตามกฎหมายและความสามารถในการเข้าถึงเว็บไซต์ตามข้อกำหนดเหล่านี้
              </div>
              <div
                className={cx(
                  "text-gray-400 text-subtitle2",
                  "mt-4 laptop:mt-5"
                )}
              >
                <span className='text-green-100'>5.2</span>{" "}
                ท่านจะต้องลงทะเบียนเป็นผู้เสนอขายหลักทรัพย์หรือนักลงทุนก่อนที่จะสามารถใช้บริการของบริษัทฯ
                ได้ท่านควรทราบว่าใบสมัครการลงทะเบียนของท่านอาจได้รับการ
                ปฏิเสธจากบริษัทฯ
              </div>
              <div
                className={cx(
                  "text-gray-400 text-subtitle2",
                  "mt-4 laptop:mt-5"
                )}
              >
                <span className='text-green-100'>5.3</span>{" "}
                หากท่านลงทะเบียนเป็นผู้เสนอขายหลักทรัพย์หรือนักลงทุนท่านจะต้องได้รับการตรวจสอบตัวตนผ่านขั้นตอนสองขั้น
                (two-step verification) ประการแรกท่านจะต้อง
                ส่งรายละเอียดพื้นฐานบางอย่างเกี่ยวกับตัวท่าน
                (ชื่อและอีเมลของท่าน)
                และเลือกชื่อผู้ใช้บริการและและรหัสผ่านที่ไม่ซ้ำกับที่อื่น
                นอกจากนี้ ท่านอาจต้องตอบคำถามเกี่ยวกับ การรักษาความปลอดภัย
                เพื่อที่บริษัทฯ จะสามารถใช้เป็นการระบุตัวตนของท่าน ทั้งนี้
                ท่านควรเก็บรักษาชื่อผู้ใช้บริการและและรหัสผ่านของท่านด้วยความปลอดภัยตลอดเวลา
              </div>
              <div
                className={cx(
                  "text-gray-400 text-subtitle2",
                  "mt-4 laptop:mt-5"
                )}
              >
                <span className='text-green-100'>5.4</span>{" "}
                เมื่อท่านส่งข้อมูลตามข้อ 5.3 ท่านจะได้รับรหัสเปิดใช้งาน
                (activation code)
                เพื่อใช้ในการเข้าขั้นตอนที่สองของกระบวนการลงทะเบียน
                ท่านจะต้องส่งข้อมูลโดย
                ละเอียดเกี่ยวกับตัวท่านเองหรือบริษัทที่ท่านเป็นตัวแทนตามที่เหมาะสม
                นอกจากนี้บริษัทฯ จะขอให้ท่านแสดงหลักฐานแสดงตัวตน
                หลักฐานที่อยู่ปัจจุบันของท่าน หรือของกรรมการบริษัท หุ้นส่วน
                หรือตัวแทนที่เกี่ยวข้องตามความเหมาะสม
                ตามนโยบายป้องกันการฟอกเงินของบริษัทฯ
                การพิจารณาคำขอเป็นผู้เสนอขาย หลักทรัพย์และนักลงทุนกับบริษัทฯ
                จะอยู่ภายใต้กระบวนการและนโยบายของบริษัทฯ
                โดยใบสมัครท่านอาจได้รับการยอมรับหรือปฏิเสธ
                ตามดุลยพินิจของบริษัทฯ
              </div>
              <div
                className={cx(
                  "text-gray-400 text-subtitle2",
                  "mt-4 laptop:mt-5"
                )}
              >
                <span className='text-green-100'>5.5</span>{" "}
                ท่านรับรองว่าข้อมูลที่ท่านมอบให้บริษัทฯ
                ในขั้นตอนการลงทะเบียนนั้นถูกต้องและครบถ้วน
              </div>
            </li>
            <li className='mt-8 laptop:mt-10 text-subtitle7 text-green-100'>
              รายละเอียดการเข้าสู่ระบบ
              <div
                className={cx(
                  "text-gray-400 text-subtitle2",
                  "mt-4 laptop:mt-[14px]"
                )}
              >
                <span className='text-green-100'>6.1</span>{" "}
                ท่านจะต้องกรอกอีเมลและรหัสผ่านทุกครั้งที่เข้าใช้เว็บไซต์ของบริษัทฯ
                ท่านอาจต้องตอบคำถามเพื่อความปลอดภัยอย่างน้อยหนึ่งข้อ
                ชื่อผู้ใช้และรหัสผ่านของท่านไม่ควรซ้ำ
                กับที่ท่านใช้สำหรับเว็บไซต์อื่น
                และท่านห้ามโอนชื่อผู้ใช้และรหัสผ่านให้กับบุคคลอื่น
              </div>
              <div
                className={cx(
                  "text-gray-400 text-subtitle2",
                  "mt-4 laptop:mt-5"
                )}
              >
                <span className='text-green-100'>6.2</span>{" "}
                ท่านต้องรับผิดชอบต่อข้อมูลและธุรกรรมทั้งหมดที่กรอกในเว็บไซต์ภายใต้ชื่อผู้ใช้และรหัสผ่านของท่าน
                ดังนั้น
                ท่านมีหน้าที่และความรับผิดชอบในการเก็บรักษาชื่อผู้ใช้และรหัสผ่านของท่าน
                และท่านจะต้องแจ้งให้บริษัทฯ
                ทราบทันทีหากท่านทราบว่าชื่อผู้ใช้และรหัสผ่านของท่านถูกเปิดเผย
                หรือการสูญหายจากการโจรกรรมหรือมีการใช้งานโดยไม่ได้รับอนุญาต
                ทั้งนี้ ท่าน:
                <ul className='list-disc pl-5 mt-2'>
                  <li>
                    ไม่สามารถโอนหรือขายชื่อผู้ใช้หรือรหัสผ่านของท่านไปยังบุคคลที่สาม
                  </li>
                  <li>
                    ยอมรับที่จะแจ้งให้บริษัทฯ
                    ทราบทันทีที่ท่านทราบว่าชื่อผู้ใช้และรหัสผ่านของท่านถูกเปิดเผย
                    หรือการสูญหายจากการโจรกรรมหรือมีการใช้งานโดยไม่ได้รับอนุญาต
                    โดยอีเมลมาที่ cs@investree.co.th
                  </li>
                </ul>
              </div>
              <div
                className={cx(
                  "text-gray-400 text-subtitle2",
                  "mt-4 laptop:mt-5"
                )}
              >
                <span className='text-green-100'>6.3</span>{" "}
                หากท่านอนุญาตให้พนักงาน
                หรือตัวแทนใช้รายละเอียดการเข้าสู่ระบบของท่าน
                ท่านจะต้องรับผิดชอบกิจกรรมของพวกเขาบนเว็บไซต์ของบริษัทฯ บริษัทฯ
                ขอสงวนสิทธิ์ที่จะไม่ปฏิบัติตามคำแนะนำของท่านในกรณีที่บริษัทฯ
                สงสัยว่าบุคคลที่ลงชื่อเข้าใช้บัญชีของท่านไม่ใช่ตัวท่านหรือบริษัทฯ
                สงสัยว่ามีกิจกรรมที่ผิดกฎหมาย หรือเป็นการฉ้อโกง
                หรือเป็นการใช้โดยที่ไม่ได้รับอนุญาต
              </div>
            </li>
            <li className='mt-8 laptop:mt-10 text-subtitle7 text-green-100'>
              ลิงค์ไปยังและจากเว็บไซต์
              <div
                className={cx(
                  "text-gray-400 text-subtitle2",
                  "mt-4 laptop:mt-[14px]"
                )}
              >
                <span className='text-green-100'>7.1</span>{" "}
                ท่านสามารถเข้าเว็บไซต์อื่นที่ดำเนินการโดยบุคคลอื่นจากเว็บไซต์ของบริษัทฯ
                ผ่านไฮเปอร์เท็กซ์หรืออินเทอร์เน็ตลิงค์
                การเชื่อมโยงดังกล่าวมีไว้เพื่อการอ้างอิงและความ
                สะดวกของท่านเท่านั้น
                โดยเว็บไซต์ดังกล่าวเป็นความรับผิดชอบเฉพาะของเจ้าของหรือผู้ดำเนินการเว็บไซต์นั้นๆ
                ท่านรับทราบและยอมรับว่าบริษัทฯ ไม่รับผิดชอบสำหรับ
                เนื้อหาหรือการทำงานของเว็บไซต์ดังกล่าว
              </div>
              <div
                className={cx(
                  "text-gray-400 text-subtitle2",
                  "mt-4 laptop:mt-5"
                )}
              >
                <span className='text-green-100'>7.2</span> บริษัทฯ
                ไม่รับรองหรืออนุมัติเนื้อหาในเว็บไซต์ที่อาจมีการเชื่อมจากเว็บไซต์ของบริษัทฯ
                ท่านมีหน้าที่ในการพิจารณาว่าท่านสามารถพึ่งพาเนื้อหาในเว็บไซต์อื่นที่ท่านเข้าถึงจาก
                เว็บไซต์ของบริษัทฯ ทางบริษัทฯ
                ไม่สามารถควบคุมเนื้อหาของเว็บไซต์เหล่านั้นและ
                ไม่รับผิดชอบต่อการสูญเสียหรือความเสียหายที่อาจเกิดขึ้นจากการใช้งานของท่าน
              </div>
              <div
                className={cx(
                  "text-gray-400 text-subtitle2",
                  "mt-4 laptop:mt-5"
                )}
              >
                <span className='text-green-100'>7.3</span>{" "}
                ห้ามนำข้อมูลเว็บไซต์ของบริษัทฯ ไปใช้ในที่อื่น หรือเว็บไซต์อื่น
                หรือสร้างลิงก์ไปยังส่วนใดของเว็บไซต์ของบริษัทฯ บริษัทฯ
                ขอสงวนสิทธิ์ในการเพิกถอนการอนุญาตการ
                เชื่อมโยงโดยไม่ต้องแจ้งให้ทราบล่วงหน้า
              </div>
              <div
                className={cx(
                  "text-gray-400 text-subtitle2",
                  "mt-4 laptop:mt-5"
                )}
              >
                <span className='text-green-100'>7.4</span> บริษัทฯ
                ไม่รับผิดชอบสำหรับการใช้ หรือการไม่สามารถใช้ซอฟต์แวร์
                หรือเนื้อหาอื่นของบุคคลที่สาม บนเว็บไซต์ของบริษัทฯ
              </div>
            </li>
            <li className='mt-8 laptop:mt-10 text-subtitle7 text-green-100'>
              การจำกัดความรับผิดและการชดใช้ค่าเสียหาย
              <div
                className={cx(
                  "text-gray-400 text-subtitle2",
                  "mt-4 laptop:mt-[14px]"
                )}
              >
                <span className='text-green-100'>8.1</span>{" "}
                ท่านยอมรับความเสี่ยงที่อาจเกิดขึ้นจากการใช้งานเว็บไซต์ของบริษัทฯ
                บริษัทในเครือ ตัวแทนเจ้าหน้าที่พนักงาน
                ซัพพลายเออร์หรือผู้ออกใบอนุญาต (Investree Parties)
                จะไม่รับผิดชอบต่อท่านหรือบุคคลอื่นใดสำหรับ:
                <ul className='list-disc pl-5 mt-2'>
                  <li>
                    ความไม่ถูกต้อง ล่าช้า ข้อขัดข้องในการให้บริการ
                    ข้อผิดพลาดที่ก่อให้เกิดความเสียหาย
                  </li>
                  <li>
                    การตัดสินใจหรือการทำธุรกรรมของท่านโดยอาศัยเว็บไซต์หรือเนื้อหาของเว็บไซต์
                  </li>
                  <li>ความเสียหายทั้งทางตรงและทางอ้อม</li>
                  <li>
                    การสูญเสียที่เกิดจากการใช้เนื้อหา
                    หรือเว็บไซต์ไม่ว่าทั้งหมดหรือบางส่วน
                    ไม่ว่าจะเกิดจากความประมาทเลินเล่อ
                    หรือภาระผูกพันที่อยู่นอกเหนือการควบคุมในการจัดหารวบรวมแปลตีความ
                    รายงาน หรือส่งมอบเว็บไซต์และเนื้อหา หรืออื่น ๆ
                  </li>
                  <li>
                    การสูญเสีย ความเสียหาย หนี้สิน การเรียกร้อง หรือค่าใช้จ่าย
                    (รวมถึง
                    ค่าใช้จ่ายทางกฎหมายและค่าใช้จ่ายในการป้องกันหรือการยอมความ)
                    ไม่ว่าโดยตรงหรือโดยอ้อมที่เกิดขึ้นจาก
                    หรืออ้างอิงถึงการใช้งานเว็บไซต์ของท่าน รวมถึงเนื้อหาต่างๆ
                    ที่เกิดขึ้นไม่ว่าจะในสัญญา การละเมิด
                    (รวมถึงความประมาทเลินเล่อ) กฎหมายหรืออื่น ๆ
                  </li>
                  <li>
                    ยอมรับที่จะแจ้งให้บริษัทฯ
                    ทราบทันทีที่ท่านทราบว่าชื่อผู้ใช้และรหัสผ่านของท่านถูกเปิดเผย
                    หรือการสูญหายจากการโจรกรรมหรือมีการใช้งานโดยไม่ได้รับอนุญาต
                    โดยอีเมลมาที่ cs@investree.co.th
                  </li>
                </ul>
              </div>
              <div
                className={cx(
                  "text-gray-400 text-subtitle2",
                  "mt-4 laptop:mt-5"
                )}
              >
                <span className='text-green-100'>8.2</span>{" "}
                ความรับผิดทั้งหมดของบริษัทฯที่มีต่อท่านในส่วนที่เกี่ยวข้องกับข้อกำหนดเหล่านี้และข้อกำหนดอื่น
                ๆ ที่เกี่ยวข้องกับการใช้งานเว็บไซต์ของบริษัทฯ จะต้องไม่เกิน
                90,000 บาท นับรวมทุกกรณี
              </div>
              <div
                className={cx(
                  "text-gray-400 text-subtitle2",
                  "mt-4 laptop:mt-5"
                )}
              >
                <span className='text-green-100'>8.3</span>{" "}
                การยกเว้นและการรับผิดชอบของบริษัทฯ
                ภายใต้ข้อกำหนดทั้งหมดนี้มีผลบังคับใช้ตามกฎหมายที่ใช้บังคับ
              </div>
              <div
                className={cx(
                  "text-gray-400 text-subtitle2",
                  "mt-4 laptop:mt-5"
                )}
              >
                <span className='text-green-100'>8.4</span>{" "}
                ท่านจะต้องชดใช้ค่าเสียหายใด ๆ ที่อาจเกิดขึ้นกับบริษัทฯ
                อันเป็นผลมาจากการที่ท่านฝ่าฝืนข้อกำหนดเหล่านี้
                ในกรณีที่ท่านใช้งานเว็บไซต์อย่างไม่เหมาะสมหรือเป็น
                อันตรายต่อบริษัทฯ
                ท่านยอมรับว่าท่านจะชดใช้ค่าเสียหายให้แก่บริษัทฯ
                สำหรับการสูญเสียใด ๆ
                ที่เกิดกับบริษัทฯหรือบุคคลที่สามอันเป็นผลมาจากการใช้งานของท่าน
              </div>
            </li>
            <li className='mt-8 laptop:mt-10 text-subtitle7 text-green-100'>
              ความพร้อมใช้งานของไซต์
              <div
                className={cx(
                  "text-gray-400 text-subtitle2",
                  "mt-4 laptop:mt-[14px]"
                )}
              >
                <span className='text-green-100'>9.1</span>{" "}
                เนื่องจากบริการทางอิเล็กทรอนิกส์อาจมีการหยุดชะงักอันเนื่องมาจากเหตุอันเกินความควบคุมของบริษัทฯ
                การเข้าถึงเว็บไซต์ของบริษัทฯ จึงเป็นการให้บริการ "ตามสภาพ" และ
                "ตามที่มีให้" เท่านั้น
              </div>
              <div
                className={cx(
                  "text-gray-400 text-subtitle2",
                  "mt-4 laptop:mt-5"
                )}
              >
                <span className='text-green-100'>9.2</span> บริษัทฯ
                สงวนสิทธิ์ในการ จำกัดการเข้าถึงเว็บไซต์ให้กับบุคคลใดก็ตาม
                การเข้าใช้ตามพื้นที่ทางภูมิศาสตร์ หรือเขตอำนาจศาล
                บริษัทฯสามารถและ/หรือระงับการเข้าถึงและ
                การใช้งานเว็บไซต์ของท่านในเวลาใดก็ได้ะตามดุลยพินิจของบริษัทฯ
              </div>
              <div
                className={cx(
                  "text-gray-400 text-subtitle2",
                  "mt-4 laptop:mt-5"
                )}
              >
                <span className='text-green-100'>9.3</span> บริษัทฯ
                อาจจำกัดการเข้าใช้งานเว็บไซต์ของบริษัทฯ
                ของท่านตามดุลยพินิจของบริษัทฯ นอกจากนี้ ทางบริษัทฯ
                อาจระงับการเข้าถึงเว็บไซต์ของบริษัทฯ เพื่อเหตุผล ทางการค้า
                เพื่อความปลอดภัยทางเทคนิค
                เพื่อให้เป็นไปตามกฎหมายหรือข้อบังคับที่เกี่ยวข้อง
                หรือเนื่องมาจากการฝ่าฝืนข้อกำหนดเหล่านี้โดยไม่ต้องแจ้งให้ท่านทราบล่วงหน้า
              </div>
            </li>
            <li className='mt-8 laptop:mt-10 text-subtitle7 text-green-100'>
              ข้อจำกัดในการใช้เว็บไซต์
              <div
                className={cx(
                  "text-gray-400 text-subtitle2",
                  "mt-4 laptop:mt-[14px]"
                )}
              >
                <span className='text-green-100'>10.1</span>{" "}
                ท่านจะต้องปฏิบัติตามกฎหมายในประเทศและกฎหมายต่างประเทศที่อาจบังคับใช้กับท่าน
                และท่านจะไม่ใช้เว็บไซต์หรือเนื้อหาของเว็บไซต์เพื่อจุดประสงค์ที่ผิดกฎหมาย
              </div>
              <div
                className={cx(
                  "text-gray-400 text-subtitle2",
                  "mt-4 laptop:mt-5"
                )}
              >
                <span className='text-green-100'>10.2</span>{" "}
                ท่านยอมรับว่าท่านจะไม่ (ทั้งตัวท่านเองหรือผ่านบุคคลที่สาม):
                <ul className='list-disc pl-5 mt-2'>
                  <li>
                    ใช้เว็บไซต์ในลักษณะใด
                    ที่อาจก่อให้เกิดความเสียหายหรือใช้งานหนักเกินไปกับเซิร์ฟเวอร์ของบริษัทฯ
                    หรือเครือข่ายใด ที่เชื่อมต่อกับเซิร์ฟเวอร์
                  </li>
                  <li>
                    ใช้เว็บไซต์ในลักษณะใดที่อาจแทรกแซงการใช้งานของสมาชิกท่านอื่นหรือ
                    ในลักษณะที่ฝ่าฝืนกฎหมายที่ใช้บังคับ
                    หรือจำกัดสิทธิของบุคคลอื่นตามกฎหมาย
                  </li>
                  <li>
                    ใช้โรบอตสไปเดอร์
                    เครื่องมือรวบรวมข้อมูลหรืออุปกรณ์หรือวิธีการใดในรูปแบบอัตโนมัติ
                    เพื่อประมวลผลตรวจสอบคัดลอกหรือแยกเว็บเพจใด
                    บนเว็บไซต์หรือข้อมูลเนื้อหาหรือข้อมูลใด
                    โดยไม่ได้รับอนุญาตเป็นลายลักษณ์อักษรล่วงหน้าจากบริษัทฯ
                  </li>
                  <li>
                    ใช้กระบวนการอัตโนมัติใด
                    เพื่อรวบรวมข้อมูลเนื้อหาที่มีอยู่ภายในเว็บไซต์
                    หรือที่เข้าถึงได้ผ่านทางเว็บไซต์ที่มาจากบุคคลที่สาม
                  </li>
                  <li>
                    ใช้กระบวนการอัตโนมัติใด
                    เพื่อแทรกแซงหรือพยายามแทรกแซงการทำงานของเว็บไซต์
                    หรือแทรกแซงการทำธุรกรรมหรือกระบวนการใดผ่านเว็บไซต์ของบริษัทฯ
                  </li>
                  <li>
                    โพสต์ อัพโหลด ส่งต่อ แจกจ่าย จัดเก็บ สร้าง
                    หรือเผยแพร่ข้อมูลบนเว็บไซต์ ด้วยข้อมูลหรือเนื้อหาที่เป็นเท็จ
                    ผิดกฎหมาย หมิ่นประมาท
                    สร้างความขุ่นเคืองต่อกลุ่มศาสนาหรือศีลธรรม หยาบคาย
                    ข่มขู่คุกคามสิทธิของบุคคลอื่น
                    เนื้อหาที่อาจก่อให้เกิดการเข้าใจผิด ฉ้อโกง
                    หรือมีแนวโน้มที่จะสร้างความสับสนให้กับผู้ใช้เว็บไซต์
                  </li>
                  <li>
                    ใช้เว็บไซต์ในทางที่ผิดโดยการใส่ไวรัส (trojan, worms, logic
                    bombs) หรือ software
                    อื่นที่อาจเป็นอันตรายกับเว็บไซต์และทรัพยากรเทคโนโลยีของบริษัทฯ
                  </li>
                  <li>
                    ดำเนินการใด ๆ
                    ที่กำหนดภาระที่ไม่สมเหตุสมผลหรือมีขนาดใหญ่เกินความจำเป็นบนโครงสร้างพื้นฐานของ
                    หรือแบนด์วิดท์ (bandwidth) ที่เชื่อมต่อกับเว็บไซต์
                  </li>
                  <li>
                    พยายามเข้าถึงเว็บไซต์หรือเซิร์ฟเวอร์ที่เก็บเว็บไซต์
                    เซิร์ฟเวอร์คอมพิวเตอร์หรือฐานข้อมูลที่เชื่อมต่อกับเว็บไซต์
                    โดยไม่ได้รับอนุญาต
                  </li>
                  <li>
                    พยายามโจมตีเว็บไซต์โดยการโจมตีแบบปฏิเสธการให้บริการ (denial
                    of service attack)
                    หรือการโจมตีแบบปฏิเสธการให้บริการแบบกระจาย (distributed
                    denial of service attack)
                    <ul className='list-disc pl-5 mt-2'>
                      <li>
                        วิศวกรย้อนกลับ (reverse engineer)
                        หรือพยายามค้นหาซอร์สโค้ดหรือสูตรหรือกระบวนการเกี่ยวกับ
                        เลขคณิตอื่น ๆ
                        ที่เกี่ยวข้องกับซอฟต์แวร์พื้นฐานโครงสร้างพื้นฐานและกระบวนการที่เกี่ยวข้องกับเว็บไซต์
                      </li>
                      <li>
                        คัดลอก ผลิต ดัดแปลง แก้ไข สร้างผลงานลอกเลียนแบบเนื้อหาใด
                        ของเว็บไซต์โดยไม่ได้รับอนุญาตเป็นลายลักษณ์อักษรล่วงหน้าจากบริษัทฯ
                      </li>
                    </ul>
                  </li>
                </ul>
              </div>
              <div
                className={cx(
                  "text-gray-400 text-subtitle2",
                  "mt-4 laptop:mt-5"
                )}
              >
                <span className='text-green-100'>10.3</span> บริษัทฯ อาจลบ
                หรือแก้ไขเนื้อหาในเว็บไซต์โดยไม่ต้องแจ้งให้ทราบล่วงหน้า
                ท่านเป็นผู้รับผิดชอบในการสร้างสำเนาเนื้อหาที่ท่านโพสต์หรือจัดเก็บบนเว็บไซต์
              </div>
              <div
                className={cx(
                  "text-gray-400 text-subtitle2",
                  "mt-4 laptop:mt-5"
                )}
              >
                <span className='text-green-100'>10.4</span> บริษัทฯ
                อาจยุติหรือระงับสิทธิ์การใช้งานเว็บไซต์ของท่าน
                หากพบว่าท่านได้ทำการละเมิดข้อกำหนดเหล่านี้
                หรือละเมิดกฎหมายที่บังคับใช้ ทางบริษัทฯ อาจทำรายงาน
                เจ้าหน้าที่ทางการและให้ความร่วมมือกับหน่วยงานเหล่านั้นหากได้รับการร้องขอ
              </div>
            </li>
            <li className='mt-8 laptop:mt-10 text-subtitle7 text-green-100'>
              สิทธิ์ในทรัพย์สินทางปัญญา
              <div
                className={cx(
                  "text-gray-400 text-subtitle2",
                  "mt-4 laptop:mt-[14px]"
                )}
              >
                <span className='text-green-100'>11.1</span>{" "}
                ข้อสังเกตคำแนะนำหรือข้อมูลอื่น ๆ
                ที่ท่านได้รับจากเว็บไซต์นี้ถือเป็นทรัพย์สินทางปัญญาของบริษัทฯ
                ท่านรับทราบว่าท่านต้องรับผิดชอบสำหรับข้อมูลใด ๆ ที่นำส่งผ่านชื่อ
                ผู้ใช้หรือรหัสผ่านของท่าน
                ท่านรับรองว่าข้อมูลที่ท่านนำส่งนั้นเป็นข้อมูลของท่าน ไม่เป็นเท็จ
                และถูกต้องตามกฎหมาย บริษัทฯ มีสิทธิ์ที่จะปฏิเสธการเผยแพร่ ลบ
                แก้ไขหรือ ตัดทอนข้อมูลที่ท่านนำส่ง ตามที่บริษัทฯ
                เห็นจำเป็นเพื่อให้สอดคล้องกับข้อกำหนดและตามกฎหมายระเบียบกระบวนการทางกฎหมาย
              </div>
              <div
                className={cx(
                  "text-gray-400 text-subtitle2",
                  "mt-4 laptop:mt-5"
                )}
              >
                <span className='text-green-100'>11.2</span> ตามข้อ 11.4
                ด้านล่าง ทางบริษัทฯ
                เป็นเจ้าของลิขสิทธิ์เครื่องหมายการค้าที่จดทะเบียนและไม่ได้จดทะเบียน
                การออกแบบของเว็บไซต์ ฐานข้อมูลและสิทธิ์ในทรัพย์สิน
                ทางปัญญาทั้งในปัจจุบันและอนาคต
                ที่อยู่บนและเกี่ยวข้องกับเว็บไซต์ของบริษัทฯ
              </div>
              <div
                className={cx(
                  "text-gray-400 text-subtitle2",
                  "mt-4 laptop:mt-5"
                )}
              >
                <span className='text-green-100'>11.3</span>{" "}
                หากสิทธิ์ในทรัพย์สินทางปัญญาดังกล่าวตกเป็นของท่านโดยการดำเนินการทางกฎหมายหรืออื่น
                ๆ ท่านตกลงที่จะมอบทรัพย์สินทางปัญญาดังกล่าวคืนกลับมาให้บริษัทฯ
              </div>
              <div
                className={cx(
                  "text-gray-400 text-subtitle2",
                  "mt-4 laptop:mt-5"
                )}
              >
                <span className='text-green-100'>11.4</span>{" "}
                ท่านยังคงความเป็นเจ้าของลิขสิทธิ์ทั้งหมดในข้อมูลที่ท่านอัพโหลดหรือส่งไปยังเว็บไซต์
                และท่านให้สิทธิ์บริษัทฯ ในการใช้งาน คัดลอก แจกจ่าย
                และเผยแพร่ข้อมูลของ ท่านทั่วโลกโดยไม่คิดค่าธรรมเนียม (royalty
                fee)
              </div>
              <div
                className={cx(
                  "text-gray-400 text-subtitle2",
                  "mt-4 laptop:mt-5"
                )}
              >
                <span className='text-green-100'>11.5</span> บริษัทฯ
                ไม่รับประกันหรือรับรองว่าเนื้อหาของเว็บไซต์ไม่ละเมิดสิทธิของบุคคลที่สามใด
                ๆ
              </div>
              <div
                className={cx(
                  "text-gray-400 text-subtitle2",
                  "mt-4 laptop:mt-5"
                )}
              >
                <span className='text-green-100'>11.6</span>{" "}
                ท่านยอมรับว่าท่านจะไม่เปิดเผยหรือสื่อสารกับบุคคลใด ๆ
                (ยกเว้นตัวแทนมืออาชีพหรือที่ปรึกษาหรือตามที่กฎหมายหรือหน่วยงานกำกับดูแลหรือกฎหมายใด
                ๆ ) ในข้อมูล ที่เป็นความลับ
                หรือข้อมูลที่ท่านได้รับจากเว็บไซต์หลังจากที่ท่านได้เป็นสมาชิก
                และได้รับชื่อผู้ใช้และรหัสผ่านจากเว็บไซต์
                ท่านจะใช้ความพยายามอย่างดีที่สุดเพื่อป้องกันการ
                เผยแพร่หรือการเปิดเผยข้อมูลที่เป็นความลับใด ๆ
                โดยไม่ได้รับอนุญาตและจะใช้ข้อมูลที่เป็นความลับดังกล่าวเพื่อจุดประสงค์ในการเสนอ
                หรือทำธุรกรรมผ่านเว็บไซต์ของบริษัทฯ เท่านั้น
                ข้อมูลที่เป็นความลับหรือข้อมูลในเว็บไซต์ตามข้อนี้ ครอบคลุม
                ข้อมูลในรูปแบบภาพ ปากเปล่า หรืออิเล็กทรอนิกส์
                ที่เกี่ยวข้องกับบริษัทฯ นักลงทุน ผู้เสนอขายหลักทรัพย์
                พนักงานและตัวแทนของบริษัทฯ
              </div>
            </li>
            <li className='mt-8 laptop:mt-10 text-subtitle7 text-green-100'>
              ลิขสิทธิ์และเครื่องหมายการค้า
              <div
                className={cx(
                  "text-gray-400 text-subtitle2",
                  "mt-4 laptop:mt-[14px]"
                )}
              >
                <span className='text-green-100'>12.1</span>{" "}
                เว็บไซต์และเนื้อหาในเว็บไซต์เป็นทรัพย์สินของบริษัทฯ
                หรือทรัพย์สินของผู้ให้อนุญาตของบริษัทฯ
                และได้รับการคุ้มครองโดยลิขสิทธิ์ เครื่องหมายการค้าและกฎหมายอื่น
                ๆ ที่บังคับใช้
              </div>
              <div
                className={cx(
                  "text-gray-400 text-subtitle2",
                  "mt-4 laptop:mt-5"
                )}
              >
                <span className='text-green-100'>12.2</span>{" "}
                ท่านได้รับอนุญาตให้ดาวน์โหลดและพิมพ์เนื้อหาจากเว็บไซต์นี้เพื่อการใช้งานส่วนตัวของท่านเองหรือในทางธุรกิจของท่านเท่าที่
                จำเป็นในการใช้บริการเว็บไซต์นี้
                เนื้อหาเว็บไซต์จะต้องไม่ถูกคัดลอกหรือถูกแก้ไขแจกจ่าย
                หรือจัดการด้วยเหตุผลอื่นใด
                โดยไม่ได้รับความยินยอมเป็นลายลักษณ์อักษรจากบริษัทฯ
              </div>
              <div
                className={cx(
                  "text-gray-400 text-subtitle2",
                  "mt-4 laptop:mt-5"
                )}
              >
                <span className='text-green-100'>12.3</span>{" "}
                ท่านยอมรับที่จะไม่ผลิต หรือเก็บส่วนหนึ่งของเว็บไซต์
                (สำหรับช่วงเวลาใด ๆ ) ในระบบอิเล็กทรอนิกส์หรือระบบสืบค้นอื่น ๆ
                แก้ไขดัดแปลง อัพโหลดข้อมูลของเว็บไซต์ ไปให้บุคคลที่สาม
                ยกเว้นในกรณีที่เป็นท่านใช้เว็บไซต์เป็นการส่วนตัวผ่านเว็บเบราว์เซอร์ของท่าน
                หรือตามที่ได้รับอนุญาตตามข้อกำหนดเหล่านี้
              </div>
            </li>
            <li className='mt-8 laptop:mt-10 text-subtitle7 text-green-100'>
              การบอกเลิก
              <div
                className={cx(
                  "text-gray-400 text-subtitle2",
                  "mt-4 laptop:mt-[14px]"
                )}
              >
                <span className='text-green-100'>13.1</span> บริษัทฯ
                อาจระงับการเข้าสู่ระบบของท่าน ไม่ว่าด้วยเหตุผลใด
                โดยมีหรือไม่มีการบอกกล่าวให้ท่านทราบล่วงหน้า
              </div>
              <div
                className={cx(
                  "text-gray-400 text-subtitle2",
                  "mt-4 laptop:mt-5"
                )}
              >
                <span className='text-green-100'>13.2</span>{" "}
                ท่านยอมรับที่จะปฏิบัติตามข้อกำหนดทั้งหมด แม้ว่าบริษัทฯ
                จะได้ทำการระงับการเข้าถึงหรือใช้งานของเว็บไซต์นี้โดยทางตรงหรือทางอ้อมของท่าน
              </div>
            </li>
            <li className='mt-8 laptop:mt-10 text-subtitle7 text-green-100'>
              ข้อกำหนดทั่วไป
              <div
                className={cx(
                  "text-gray-400 text-subtitle2",
                  "mt-4 laptop:mt-[14px]"
                )}
              >
                <span className='text-green-100'>14.1</span> บริษัทฯ
                อาจปฏิบัติตามข้อผูกพันของบริษัทฯและใช้สิทธิใด ๆ ผ่านบุคคลที่สาม
                บริษัทฯ อาจมอบหมายสิทธิ์และภาระหน้าที่ใด ๆ หรือทั้งหมดของบริษัทฯ
                ภายใต้ข้อกำหนดเหล่านี้ให้กับบุคคลที่สาม
              </div>
              <div
                className={cx(
                  "text-gray-400 text-subtitle2",
                  "mt-4 laptop:mt-5"
                )}
              >
                <span className='text-green-100'>14.2</span>{" "}
                หากพบว่าข้อใดหรือส่วนใดส่วนหนึ่งของข้อตกลงเหล่านี้เป็นโมฆะไม่สามารถบังคับใช้ได้หรือไม่ถูกต้องก็จะถูกตัดออกจากข้อกำหนดเหล่านี้
                โดยปล่อยให้ส่วนที่เหลือมีผลบังคับใช้ต่อไป
              </div>
              <div
                className={cx(
                  "text-gray-400 text-subtitle2",
                  "mt-4 laptop:mt-5"
                )}
              >
                <span className='text-green-100'>14.3</span> บริษัทฯ
                ไม่ได้ใช้สิทธิตามข้อกำหนดนี้ หรือทำการบังคับใช้สิทธิล่าช้า
                ไม่ถือว่าบริษัทฯ สละสิทธิ์ของบริษัทฯ
                ภายใต้ข้อกำหนดและเงื่อนไขอื่นที่เกี่ยวข้อง
              </div>
              <div
                className={cx(
                  "text-gray-400 text-subtitle2",
                  "mt-4 laptop:mt-5"
                )}
              >
                <span className='text-green-100'>14.4</span>{" "}
                หากพบว่าข้อใดหรือส่วนใดส่วนหนึ่งของข้อตกลงเหล่านี้ขัดต่อกฎหมาย
                ไม่ถูกต้อง หรือไม่สามารถบังคับใช้โดยศาลที่มีเขตอำนาจใด ๆ
                ข้อดักงล่าวจะถูกตัด
                ออกจากข้อกำหนดเหล่านี้โดยปล่อยให้ส่วนที่เหลือมีผลบังคับใช้ต่อไป
              </div>
              <div
                className={cx(
                  "text-gray-400 text-subtitle2",
                  "mt-4 laptop:mt-5"
                )}
              >
                <span className='text-green-100'>14.5</span>{" "}
                การปฏิเสธความรับผิดการชดใช้ค่าเสียหายและการยกเว้นทั้งหมดในข้อกำหนดเหล่านี้จะคงอยู่ต่อไปจนกว่าจะมีการยกเลิกข้อกำหนด
              </div>
              <div
                className={cx(
                  "text-gray-400 text-subtitle2",
                  "mt-4 laptop:mt-5"
                )}
              >
                <span className='text-green-100'>14.6</span>{" "}
                ข้อกำหนดเหล่านี้และเอกสารที่อ้างถึงข้อกำหนดให้ถือเป็นส่วนหนึ่งของภาระผูกพันและสัญญาระหว่างท่านและบริษัทฯ
                ในการใช้งานบริษัทฯ และในการใช้บริการบริษัทฯ ผ่านเว็บไซต์
              </div>
              <div
                className={cx(
                  "text-gray-400 text-subtitle2",
                  "mt-4 laptop:mt-5"
                )}
              >
                <span className='text-green-100'>14.7</span>{" "}
                ข้อกำหนดเหล่านี้พร้อมกับเอกสารที่อ้างข้อกำหนด
                และภาระผูกพันที่ไม่ใช่สัญญาที่อาจเกิดขึ้นนั้นจะได้รับการครอบคลุมโดยกฎหมายของประเทศไทย
                ท่านยอมจำนนต่ออำนาจศาลประเทศไทย
              </div>
            </li>
            <li className='mt-8 laptop:mt-10 text-subtitle7 text-green-100'>
              เกี่ยวกับบริษัทฯ
              <div
                className={cx(
                  "text-gray-400 text-subtitle2",
                  "mt-4 laptop:mt-[14px]"
                )}
              >
                Investree เป็น บริษัท
                ที่จัดตั้งขึ้นในประเทศไทยซึ่งมีสำนักงานจดทะเบียนและที่ตั้งของธุรกิจหลักอยู่ที่ชั้น
                12, ห้อง B, อาคารเลครัชดา ออฟฟิส คอมเพล็กซ์, 195/13
                ถนนรัชดาภิเษก เขตคลองเตย กรุงเทพมหานคร 10110
              </div>
            </li>
            <li className='mt-8 laptop:mt-10 text-subtitle7 text-green-100'>
              การติดต่อบริษัทฯ
              <div
                className={cx(
                  "text-gray-400 text-subtitle2",
                  "mt-4 laptop:mt-[14px]"
                )}
              >
                1.
                หากท่านมีข้อสงสัยเกี่ยวกับข้อกำหนดเหล่านี้หรือต้องการติดต่อบริษัทฯ
                กรุณาส่งอีเมลของท่านมาที่ cs@investree.co.th
              </div>
            </li>
          </ul>
        </div>
      </div>
    </Layout>
  );
};

export default TermOfUsePage;

export const getStaticProps = async ({ locale }: ILocaleProps) => {
  return {
    props: {
      messages: (await import(`../../../messages/${locale}.json`)).default,
    },
  };
};
