import PageHeadTitle from "components/atoms/PageHeadTitle";
import PrivacyPageContentDetail from "components/atoms/PrivacyPageContentDetail";
import PrivacyPageContentTitle from "components/atoms/PrivacyPageContentTitle";
import Layout from "components/templates/Layout";
import { cx } from "helpers/utils";
import { ILocaleProps } from "interfaces/general";

const PrivacyPolicyPage = () => {
  return (
    <Layout>
      <div>
        <PageHeadTitle title='ข้อกำหนดการใช้งานทั่วไป' />
        <div
          className={cx(
            "container rounded-3xl w-[350px] bg-white text-subtitle2 text-gray-400",
            "py-5 px-5 mt-[40px] mb-[100px]",
            "tablet:max-w-[1200px] tablet:w-[calc(100%-64px)]",
            "laptop:max-w-[1200px]",
            "laptop:py-14 laptop:px-20 laptop:mt-[100px]"
          )}
        >
          <div>
            บริษัท อินเวสทรี (ไทยแลนด์) จำกัด
            ในฐานะผู้ได้รับใบอนุญาตให้เป็นผู้ให้บริการระบบคราวด์ฟันดิง
            (Crowdfunding portal) (ต่อไปจะเรียกว่า “ผู้ให้บริการ”)
            คำนึงถึงความสำคัญ ของความเป็นส่วนตัวของท่าน
            ในฐานะผู้ใช้บริการผ่านช่องทางการให้บริการทุกช่องทางของผู้ให้บริการ
            รวมถึงผู้ออกและระดมทุนด้วยแพลตฟอร์มคราวด์ฟันดิง (“ผู้ระดมทุน”)
            และผู้ลงทุนในหลักทรัพย์คราวด์ฟันดิง (“ผู้ลงทุน”)
            (ต่อไปจะเรียกรวมกันว่า “ผู้ใช้บริการ”)
            ให้ความสำคัญต่อความเป็นส่วนตัวและความปลอดภัยของข้อมูลส่วนบุคคลของผู้ใช้บริการ
            ผู้ให้บริการจึงจัดทำนโยบายคุ้มครองข้อมูลส่วนบุคคลฉบับนี้ (“นโยบาย”)
            ขึ้น ทั้งนี้เมื่อผู้ใช้บริการสมัครเพื่อใช้บริการของผู้ให้บริการ
            ทางผู้ให้บริการจะถือว่า ผู้ใช้บริการตกลงรับทราบ
            และยอมรับเงื่อนไขการประมวลผลข้อมูลส่วนบุคคลที่ผู้ให้บริการประกาศในนโยบายฉบับนี้อย่างครบถ้วนแล้ว
          </div>
          <PrivacyPageContentTitle>นิยามศัพท์</PrivacyPageContentTitle>
          <PrivacyPageContentDetail>
            <div>
              “ข้อมูลส่วนบุคคล”
              ในนโยบายฉบับนี้ตีความโดยสอดคล้องกับพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคลของประเทศไทย
              (“พ.ร.บ. คุ้มครองข้อมูลส่วนบุคคล”) ซึ่งหมายถึง
              ข้อมูลที่ทำให้สามารถระบุตัวตนของผู้ใช้บริการแต่ละบุคคลได้
              รวมถึงแต่ไม่จำกัดเพียง ข้อมูล เช่น ชื่อ รายละเอียดการติดต่อ
              ที่อยู่ เอกสารการระบุตัวตน ซึ่งผู้ให้บริการอาจเข้าถึง
              หรือได้รับจากผู้ใช้บริการโดยหลักจากการใช้บริการแพลตฟอร์มคราวด์ฟันดิงของผู้ให้บริการ
              (“แพลตฟอร์ม”)
              ผ่านการติดต่อเพื่อใช้บริการอื่นที่จัดให้มีขึ้นโดยผู้ให้บริการ
              (“บริการ”)
              รวมถึงผ่านแหล่งข้อมูลภายนอกอื่นที่ผู้ให้บริการจะแจ้งให้ผู้ใช้บริการทราบ
            </div>
            <div className='mt-5'>
              “เจ้าของข้อมูลส่วนบุคคล” หมายถึง (1) ผู้ลงทุนที่เป็นบุคคลธรรมดา
              (2) บุคคลที่เกี่ยวข้องกับผู้ระดมทุนซึ่งเป็นนิติบุคคล
              หรือบุคคลที่เกี่ยวข้องกับผู้ลงทุนที่เป็นนิติบุคคล ซึ่งอาจรวมถึง
              ผู้ถือหุ้นรายใหญ่ กรรมการผู้มีอำนาจลงนาม ผู้รับมอบอำนาจทอดสุดท้าย
              พนักงาน และบุคคลธรรมดาอื่นที่เกี่ยวข้อง
              และ/หรือได้รับการแต่งตั้งให้ประสานงาน
              กับผู้ให้บริการเพื่อการใช้แพลตฟอร์ม
              และ/หรือบริการของผู้ให้บริการนั้น
              และรวมถึงลูกค้าหรือคู่ค้าที่เป็นบุคคลธรรมดาของผู้ระดมทุน
              ซึ่งผู้ระดมทุนอาจนำส่งข้อมูล ของเจ้าของข้อมูลส่วนบุคคลดังกล่าว
              เพื่อการประเมินคุณสมบัติและความเหมาสมของผู้ระดมทุน
              (“บุคคลที่เกี่ยวข้องกับนิติบุคคล”) (3) บุคคลอื่นใด ๆ
              ที่เป็นเจ้าของข้อมูลส่วนบุคคล
            </div>
          </PrivacyPageContentDetail>
          <PrivacyPageContentTitle>
            แหล่งที่มาของข้อมูลส่วนบุคคล
          </PrivacyPageContentTitle>
          <div className='mt-[14px] pl-3 laptop:pl-[29px]'>
            <div>
              ผู้ให้บริการอาจได้รับข้อมูลส่วนบุคคลของผู้ใช้บริการจากหลายแหล่งที่มาทั้งทางตรง
              และทางอ้อมจากเจ้าของข้อมูลส่วนบุคคล ซึ่งรวมถึงแต่ไม่จำกัดเพียง
            </div>
            <ul className='list-disc pl-5 mt-4'>
              <li>
                <span className='font-semibold'>
                  การให้ข้อมูลโดยตรงจากเจ้าของข้อมูลส่วนบุคคล
                </span>{" "}
                ซึ่งเจ้าของข้อมูลส่วนบุคคลอาจ ลงทะเบียน
                และ/หรือให้ข้อมูลที่เกี่ยวข้อง ผ่านแพลตฟอร์มหรือแบบฟอร์มอื่นที่
                ผู้ให้บริการอาจกำหนดขึ้นเพื่อขอข้อมูลของ
                ผู้ใช้บริการรวมถึงผ่านการติดต่อประสานงานระหว่างผู้ให้บริการและเจ้าของข้อมูล
                ส่วนบุคคลดังกล่าวผ่านช่องทางการติดต่อ สื่อสารต่างๆ
                ที่ผู้ให้บริการอาจกำหนด
                ซึ่งรวมถึงข้อมูลในกระบวนการบริหารจัดการแก้ไขข้อร้องเรียน
                และข้อมูลการติดต่อผ่าน Webboard ที่ผู้ให้บริการต้องจัดให้มีขึ้น
                เพื่อการติดต่อสื่อสารระหว่างผู้ใช้บริการ
              </li>
            </ul>
            <div className='mt-8'>
              ทั้งนี้ กรณีผู้ใช้บริการให้ข้อมูลส่วนบุคคลของ
              บุคคลที่เกี่ยวข้องกับนิติบุคคลแก่ผู้ให้บริการ
              ผู้ให้บริการจะถือว่าผู้ใช้บริการรับรองและรับ
              ประกันว่าผู้ใช้บริการมีสิทธิอันชอบด้วยกฎหมาย ภายใต้ พ.ร.บ.
              คุ้มครองข้อมูลส่วนบุคคลในการ
              ส่งต่อเปิดเผยข้อมูลของบุคคลที่เกี่ยวข้องกับ
              นิติบุคคลแต่ละบุคคลเพื่อให้ผู้ให้บริการ
              ประมวลผลภายใต้เงื่อนไขที่ระบุไว้ในนโยบาย ฉบับนี้แล้ว
            </div>
            <ul className='list-disc pl-5 mt-4'>
              <li>
                <span className='font-semibold'>ได้รับข้อมูลทางอ้อม</span>{" "}
                ซึ่งอาจรวมถึง (1)
                การที่ผู้ให้บริการได้รับข้อมูลส่วนบุคคลของเจ้าของข้อมูลส่วนบุคคลจากพันธมิตรทางการค้าที่อาจส่งต่อข้อมูลขอเจ้าของ
                ข้อมูลส่วนบุคคลให้ผู้ให้บริการเพื่อประมวลผล หรือ (2)
                ผู้ให้บริการภายนอกที่ผู้ให้บริการอาจจำเป็นต้องเชื่อมโยงส่งต่อข้อมูลของเจ้าของข้อมูลส่วนบุคคลเพื่อการตรวจสอบ
                คุณสมบัติในการให้บริการ
                หรือเพื่อการดำเนินธุรกรรมที่เกี่ยวข้องในกระบวนการระดมทุนหลักทรัพย์คราวด์ฟันดิงให้สำเร็จ
                เพื่อประโยชน์ของผู้ใช้บริการ ซึ่งอาจรวมถึง ธนาคารพาณิชย์
                ในฐานะผู้เก็บรักษาทรัพย์ สิน
                รวมถึงแหล่งข้อมูลที่เปิดเผยต่อสาธารณชน
                ฐานข้อมูลของหน่วยงานราชการ เครดิตบูโร
                หรือผู้ให้บริการฐานข้อมูลการยืนยันตัวตน เป็นต้น
              </li>
            </ul>
          </div>
          <PrivacyPageContentTitle>
            ข้อมูลที่ผู้ให้บริการจำเป็นต้องประมวลผลข้อมูล
          </PrivacyPageContentTitle>
          <div className='mt-[14px] pl-3 laptop:pl-[29px]'>
            <div>
              เพื่อการให้บริการแพลตฟอร์มระดมทุนและออกเสนอขายหลักทรัพย์คราวด์ฟันดิง
              ภายใต้กำกับของสำนักงานคณะกรรมการกำกับหลัก ทรัพย์และตลาดหลักทรัพย์
              (“สำนักงาน ก.ล.ต.”) ผู้ให้บริการจำเป็นต้องเก็บ รวบรวม ประมวลผล
              และใช้ข้อมูลส่วนบุคคลของ เจ้าของข้อมูลส่วนบุคคล ดังต่อไปนี้
            </div>
            <ul className='list-decimal pl-5 mt-5'>
              <li className='mt-5'>
                <span className='font-semibold'>
                  ข้อมูลการยืนยันตัวตนของเจ้าของข้อมูลส่วนบุคคล
                </span>{" "}
                ได้แก่ ชื่อนามสกุล ข้อมูลการติดต่อ (ได้แก่ เบอร์โทรศัพท์
                และอีเมล) ข้อมูลสถานที่เกิด วันเดือนปีเกิด สัญชาติ สถานภาพ
                รายละเอียดบัตรประจำตัวประชาชน (รวมถึง
                ข้อมูลเลขบัตรประจำตัวประชาชน เลข laser code
                หลังบัตรประจำตัวประชาชน วันที่ออกและหมดอายุ รวมถึงภาพถ่ายบัตร)
                ที่อยู่ตามบัตรประจำตัวประชาชน และที่อยู่ปัจจุบัน การศึกษา อาชีพ
                ตำแหน่ง ที่มาของรายได้
                ภาพถ่ายใบหน้าของเจ้าของข้อมูลส่วนบุคคลซึ่งระบบของบริษัทต้องใช้เพื่อเปรียบเทียบแบบ
                Biometric Comparison (ซึ่งผู้ให้บริการจะขอความยินยอมจาก
                เจ้าของข้อมูลส่วนบุคคลก่อน
                แต่หากเจ้าของข้อมูลส่วนบุคคลไม่ยินยอมให้ข้อมูลดังกล่าว
                ผู้ให้บริการสงวนสิทธิในการปฏิเสธ การให้บริการแก่
                ผู้ใช้บริการที่เกี่ยวข้อง
                เนื่องจากข้อมูลดังกล่าวจำเป็นสำหรับการปฏิบัติหน้าที่ของผู้ให้บริการ
                ภายใต้กำหนด ของสำนักงาน ก.ล.ต. และหน่วยงานกำกับอื่น
                และอาจรวมถึงแบบฟอร์มการยืนยันตัวตนและตรวจสอบคุณสมบัติอื่น เช่น
                FATCA form
              </li>
              <li className='mt-5'>
                <span className='font-semibold'>
                  ข้อมูลเพื่อการประเมินคุณสมบัติของผู้ระดมทุน
                </span>{" "}
                ได้แก่ ข้อมูลการศึกษา ประสบการณ์ และความเชี่ยวชาญ
                ข้อมูลเครดิตบูโรของบุคคลที่เกี่ยวข้องกับนิติบุคคล
                และข้อมูลอื่นที่อาจมีการเก็บ รวบรวม
                ประมวลผลระหว่างการติดต่อประสานงาน การตรวจสอบเอกสาร
                และการสัมภาษณ์การประเมินคุณสมบัติในการเป็นผู้ระดมทุน
                รวมถึงข้อมูลของบุคคลที่เกี่ยวข้องกับนิติบุคคล
                ซึ่งเป็นลูกค้าหรือคู่ค้าของผู้ระดมทุน
                ซึ่งผู้ระดมทุนอาจนำส่งให้ผู้ให้บริการประเมินความเหมาะสม
                ในการออกและเสนอขายหลักทรัพย์คราวด์ฟันดิง
              </li>
              <li className='mt-5'>
                <span className='font-semibold'>
                  ข้อมูลเพื่อการประเมินคุณสมบัติของผู้ลงทุน
                </span>{" "}
                โดยเฉพาะผู้ลงทุนที่มีลักษณะเฉพาะ ตามนิยามที่กำหนดโดยสำนักงาน
                ก.ล.ต. ซึ่งอาจรวมถึงแต่ไม่จำกัดเพียง เอกสารแสดงฐานะทางการเงิน
                (สินทรัพย์หรือรายได้) หรือเอกสารแสดงความรู้ความเชี่ยวชาญ
                การประกอบธุรกิจหรือการลงทุนที่ผ่านมาของผู้ลงทุนดังกล่าว
              </li>
              <li className='mt-5'>
                <span className='font-semibold'>
                  ข้อมูลทางอิเล็กทรอนิกส์ที่สามารถระบุตัวตนของผู้ใช้บริการได้
                  (Online Identifier)
                </span>{" "}
                ได้แก่ username / password
                ข้อมูลเกี่ยวกับอุปกรณ์ที่ผู้ใช้บริการใช้สำหรับการเชื่อมต่อแพลตฟอร์มหรือติดต่อกับผู้ให้บริการ
                อาทิเช่น หมายเลข IP รหัสประจำ ตัวอุปกรณ์ ประเภทอุปกรณ์
                ข้อมูลเครือข่ายมือถือ ข้อมูลการเชื่อมต่อ
                ข้อมูลตำแหน่งที่ตั้งทางภูมิศาสตร์ ประเภทของเบราว์เซอร์ (Browser)
                ข้อมูลบันทึกการเข้าออกแพลตฟอร์ม
                ข้อมูลเว็บไซต์ที่ผู้ใช้งานเข้าถึงก่อนและหลังการเข้ามาเชื่อมต่อกับแพลตฟอร์ม
                (Referring Website) พฤติกรรมการใช้งานแพลตฟอร์ม (Customer
                Behavior) (รวมถึง ข้อมูลที่ค้นหา การใช้ฟังก์ชันต่าง ๆ
                บนแพลตฟอร์ม)
                และข้อมูลที่ผู้ให้บริการได้เก็บรวบรวมผ่านคุกกี้หรือเทคโนโลยีอื่นที่คล้ายกัน
              </li>
              <div className='mt-4 laptop:mt-5 -ml-5'>
                ทั้งนี้ สำหรับการใช้คุกกี้ ผู้ใช้บริการรับทราบว่า
                ผู้ให้บริการได้ติดตั้ง “คุกกี้ (Cookies)”
                ซึ่งเป็นไฟล์คอมพิวเตอร์ที่จะทำการเก็บข้อมูลชั่วคราวที่จำเป็น
                ลงในเครื่องคอมพิวเตอร์ของผู้ใช้บริการ
                เพื่อความสะดวกในการใช้แพลตฟอร์มของผู้ใช้บริการ
                ซึ่งผู้ใช้บริการสามารถตั้งค่าการใช้คุกกี้ดังกล่าวได้ แต่ทั้งนี้
                คุกกี้จะหมดอายุหรือสิ้นผล เมื่อสิ้นสุดการใช้งานระบบหรือการเชื่อม
                โยงข้อมูลบนแพลตฟอร์ม หรือจนกว่าผู้ใช้บริการจะลบ “คุกกี้”
                จากเครื่องคอมพิวเตอร์ของผู้ให้บริการหรือผู้ให้บริการตั้งค่าไม่อนุญาตให้คุกกี้นั้นทำงานอีกต่อไป
              </div>
              <li className='mt-5'>
                <span className='font-semibold'>
                  ข้อมูลธุรกรรมทั้งหมดที่ผู้ใช้บริการอาจใช้บริการผ่านแพลตฟอร์ม
                </span>{" "}
                ได้แก่ ข้อมูลในการทำธุรกรรมใดผ่านบัญชีผู้ใช้งานของผู้ใช้บริการ
                ข้อมูลการลงลายมือชื่ออิเล็กทรอนิกส์
                ข้อมูลคำสั่งจองซื้อหลักทรัพย์คราวด์ฟันดิง
                ข้อมูลการโอนหรือรับโอนหลักทรัพย์คราวด์ฟันดิง รายละเอียดธุรกรรม
                วัตถุประสงค์ในการทำธุรกรรม ประวัติการทำธุรกรรม
                รายละเอียดและประวัติการชำระเงิน ข้อมูลภาษีหัก ณ ที่จ่าย
                ข้อมูลบันทึกประวัติการใช้แพลตฟอร์ม ข้อมูลบันทึกการเข้าสู่ระบบ
                (Login Log) ข้อมูลรายการการทำธุรกรรม (Transaction Log)
                เวลาที่เยี่ยมชมและใช้บริการแพลตฟอร์ม (Access Time)
              </li>
              <li className='mt-5'>
                <span className='font-semibold'>
                  ข้อมูลส่วนบุคคลอื่นที่ผู้ใช้บริการอาจให้แก่ผู้ให้บริการ
                </span>{" "}
                ซึ่งอาจรวมถึงแต่ไม่จำกัดเพียง ภาพถ่าย (ภาพนิ่งและภาพเคลื่อนไหว)
                ของผู้ใช้บริการที่อาจเข้าร่วมกิจกรรม หรือการฝึกอบรม (Event /
                Webinar) ที่ผู้ให้บริการอาจจัดขึ้นทั้งในรูปแบบ Online หรือ
                Offline ข้อมูล Testimonial
                หรือความเห็นของผู้ใช้บริการที่ผู้ใช้บริการอาจให้เกี่ยวกับผู้ให้บริการ
                แพลตฟอร์ม และ/หรือบริการอื่น
                หรือข้อมูลส่วนบุคคลอื่นไม่ว่าส่วนใดที่ผู้ใช้บริการอาจติดต่อและแจ้งให้ผู้ให้บริการทราบ
                ระหว่างการติดต่อ สื่อสารระหว่างผู้ใช้บริการและผู้ให้บริการ
                ซึ่งอาจรวมถึงแต่ไม่จำกัดเพียง
                ข้อมูลรายละเอียดเรื่องร้องเรียนหรือการออกความ เห็น
                คำขอใช้สิทธิต่าง ๆ ผลประเมินการสำรวจความคิดเห็น
                และบันทึกการสื่อสารหรือการโต้ตอบระหว่างท่านกับบริษัท บันทึกเสียง
                ภาพถ่าย ภาพเคลื่อนไหว คลิปบันทึกเสียง บันทึกการสื่อสารผ่าน Log /
                Chat-Bot เป็นต้น
              </li>
            </ul>
          </div>
          <PrivacyPageContentTitle>
            วัตถุประสงค์การประมวลข้อมูลส่วนบุคคลของเจ้าของข้อมูลส่วนบุคคล
          </PrivacyPageContentTitle>
          <div className='mt-[14px] pl-3 laptop:pl-[29px]'>
            <div>
              เพื่อการให้บริการแก่ผู้ใช้บริการ ผู้ให้บริการจำเป็นต้องเก็บ รวบรวม
              ประมวลผล
              ใช้ข้อมูลส่วนบุคคลของเจ้าของข้อมูลส่วนบุคคลด้วยวัตถุประสงค์ดังต่อไปนี้
            </div>
            <ul className='list-decimal pl-5'>
              <li className='mt-4 laptop:mt-5 marker:text-green-300'>
                <span className='text-green-300'>
                  เพื่อการปฏิบัติหน้าที่ตามกฎหมายของผู้ให้บริการ{" "}
                </span>
                ในฐานะผู้ให้บริการระบบการออกและเสนอขายหลักทรัพย์คราวด์ฟันดิง
                ภายใต้กำกับดูแลของสำนักงาน ก.ล.ต.
                และหน่วยงานกำกับภายใต้กฎหมายอื่น
                ผู้ให้บริการจำเป็นต้องประมวลผลข้อมูลส่วนบุคคล
                ของเจ้าของข้อมูลส่วนบุคคล เพื่อวัตถุประสงค์ย่อย ดังนี้
                <ul className='list-disc'>
                  <li className='mt-2 marker:text-gray-400'>
                    การพิสูจน์และยืนยันตัวบุคคล
                    รวมถึงการดำเนินกระบวนการทำความรู้จักผู้ใช้บริการ
                    ตามที่กำหนดไว้ในแนวปฏิบัติในการนำเทคโนโลยีมาใช้ในการทำความรู้จักลูกค้า
                    ที่สำนักงาน ก.ล.ต. กำหนด ซึ่งรวมถึงการพิสูจน์ตัวตน
                    การยืนยันตัวตน การทำความรู้จักลูกค้าในเชิงลึก
                    และการทบทวนข้อมูลผู้ใช้บริการในฐานะลูกค้าของบริษัท
                  </li>
                  <li className='mt-2 marker:text-gray-400'>
                    การตรวจสอบตัวตนและคุณสมบัติของผู้ใช้บริการ โดยเฉพาะ (1)
                    การทดสอบความเข้าใจเกี่ยวกับการลงทุนของผู้ลงทุน
                    และการตรวจสอบคุณสมบัติการเป็นผู้ลงทุน ที่มีลักษณะเฉพาะ
                    การตรวจสอบการทำธุรกรรมจองซื้อของผู้ลงทุนเพื่อจำกัดมูลค่าการลงทุนในหลักทรัพย์คราวด์ฟันดิงของผู้ลงทุนรายบุคคล
                    และ (2) การตรวจสอบสถานะ (Due Diligence)
                    และความเหมาะสมในการใช้บริการของผู้ระดมทุน
                    การประเมินเครดิตและความน่าเชื่อถือในการออกหลักทรัพย์คราวด์ฟันดิง
                    และการประเมินความน่าเชื่อถือและระดับความเสี่ยงของหลัก
                    ทรัพย์คราวด์ฟันดิง
                  </li>
                  <li className='mt-2 marker:text-gray-400'>
                    การจัดทำเอกสารบัญชี ภาษีของผู้ให้บริการ
                    รวมถึงการอำนวยความสะดวกในการให้บริการการเสียภาษีให้แก่ผู้ใช้บริการที่เกี่ยวข้อง
                    (ตามการมอบหมายหรือมอบอำนาจ)
                  </li>
                  <li className='mt-2 marker:text-gray-400'>
                    การจัดทำเอกสารบัญชี ภาษีของผู้ให้บริการ
                    รวมถึงการอำนวยความสะดวกในการให้บริการการเสียภาษีให้แก่ผู้ใช้บริการที่เกี่ยวข้อง
                    (ตามการมอบหมายหรือมอบอำนาจ)
                  </li>
                </ul>
              </li>
              <li className='mt-4 laptop:mt-5 marker:text-green-300'>
                <span className='text-green-300'>
                  เพื่อการปฏิบัติตามหน้าที่ที่ผู้ให้บริการมีภายใต้เงื่อนไขการให้บริการ
                </span>{" "}
                ซึ่งผู้ใช้บริการเป็นคู่สัญญากับผู้ให้บริการ
                หรือเพื่อให้ผู้ให้บริการสามารถดำเนินการ
                ตามคำขอของผู้ใช้บริการก่อนที่จะเข้าทำสัญญาได้
                ผู้ให้บริการจำเป็นต้องประมวลผลข้อมูลส่วนบุคคล
                ของเจ้าของข้อมูลส่วนบุคคล เพื่อวัตถุประสงค์ย่อย ดังนี้
                <ul className='list-disc'>
                  <li className='mt-2 marker:text-gray-400'>
                    การให้ข้อมูลที่เกี่ยวข้องกับบริการของผู้ให้บริการ
                    ตามที่ผู้ใช้บริการอาจติดต่อ และ/หรือร้องขอจากผู้ให้บริการ
                    ก่อนการเปิดบัญชีผู้ใช้งาน และตลอดการให้บริการ
                    ซึ่งอาจรวมถึงแต่ไม่จำกัด การให้ข้อมูลเบื้องต้น
                    หรือการให้ข้อมูลเพื่อการบริหารจัดการข้อร้องเรียนใดที่ผู้ให้บริการอาจมี
                  </li>
                  <li className='mt-2 marker:text-gray-400'>
                    การระบุเชื่อมโยงตัวตนผู้ใช้บริการที่ดำเนินธุรกรรมต่าง ๆ
                    บนแพลตฟอร์ม การติดต่อประสานงานระหว่างการดำเนินธุรกรรม
                    การใช้แพลตฟอร์ม การใช้บริการอื่น
                    ตั้งแต่เริ่มต้นจนดำเนินธุรกรรมทั้งหมดสำเร็จ
                    ภายใต้เงื่อนไขการใช้บริการที่ผู้ให้บริการกำหนดไว้
                    ซึ่งรวมถึงแต่ไม่จำกัดเพียง การติดต่อประสานงานผู้ระดมทุน
                    และผู้ลงทุน ระหว่างขั้นตอน (1)
                    การเสนอขายและจองซื้อหลักทรัพย์คราวด์ฟันดิง (2)
                    การจับคู่ระหว่างผู้ใช้บริการ (3)
                    การจัดทำเอกสารหลักทรัพย์คราวด์ฟันดิง
                    และการแต่งตั้งตัวแทนผู้ถือหลักทรัพย์คราวด์ฟันดิง (ถ้าจำเป็น)
                    (4) การติดตามการชำระราคาจองซื้อหลักทรัพย์คราวด์ฟันดิง
                    และการส่งมอบหลักทรัพย์คราวด์ฟันดิง และ (5)
                    การติดตามการปฏิบัติหน้าที่ของผู้ใช้บริการ ภายใต้ข้อ
                    กําหนดว่าด้วยสิทธิและหน้าที่ของผู้ออกหลักทรัพย์และผู้ถือหลักทรัพย์คราวด์ฟันดิง
                  </li>
                  <li className='mt-2 marker:text-gray-400'>
                    การติดตามและตรวจสอบการดำเนินธุรกรรมผ่านทางแพลตฟอร์ม เช่น
                    การใช้งานหรือดำเนินธุรกรรมต่าง ๆ
                    ที่เกี่ยวข้องกับบัญชีการใช้งาน การเปลี่ยนแปลงข้อมูล
                    การใช้งานระบบ การตรวจสอบและการยืนยันการทำธุรกรรม
                    การตรวจสอบและปรับปรุงรายการธุรกรรม
                    การจัดทำรายงานที่เกี่ยวข้องกับการทำธุรกรรม
                    เพื่อประโยชน์ในการติดตามและตรวจสอบย้อนหลังโดยผู้ใช้บริการเอง
                  </li>
                  <li className='mt-2 marker:text-gray-400'>
                    การปฏิบัติสิทธิและหน้าที่อื่นของผู้ให้บริการ เช่น
                    การติดตามทวงถามจำนวนเงินใดๆ
                    ทั้งหมดที่ผู้ใช้บริการอาจติดค้างต้องชำระให้แก่ผู้ให้บริการ
                    การติดต่อสื่อสารข้อมูลเกี่ยวกับบริการ บริการเพิ่มเติม
                    การให้บริการของแพลตฟอร์ม ข้อมูลอื่น
                    ที่ผู้ให้บริการต้องแจ้งให้ผู้ใช้บริการทราบ
                    เกี่ยวกับการใช้บริการ และการใช้แพลตฟอร์ม
                    รวมถึงการปฏิบัติหน้าที่ตามสัญญาอื่นที่ผู้ให้บริการอาจมีกับผู้ใช้บริการ
                  </li>
                </ul>
              </li>
              <li className='mt-4 laptop:mt-5 marker:text-green-300'>
                <span className='text-green-300'>
                  เพื่อประโยชน์ในการใช้และรักษาสิทธิประโยชน์อันชอบด้วยกฎหมายของผู้ให้บริการ
                </span>{" "}
                โดยไม่กระทบสิทธิของเจ้าของข้อมูลส่วนบุคคลมากเกินสมควร
                ผู้ให้บริการจำเป็นต้องประมวลผลข้อมูลส่วนบุคคล
                ของเจ้าของข้อมูลส่วนบุคคล เพื่อวัตถุประสงค์ย่อย ดังนี้
                <ul className='list-disc'>
                  <li className='mt-2 marker:text-gray-400'>
                    การจัดการปรับปรุงความสัมพันธ์ทางธุรกิจ
                    และการให้บริการที่ผู้ให้บริการจะดำเนินการให้ผู้ใช้บริการ
                    โดยเฉพาะเพื่อการพัฒนา
                    และปรับปรุงแพลตฟอร์มแลระบบการให้บริการของผู้ให้บริการ
                    เพื่อให้บริการได้มีประสิทธิภาพมากขึ้น
                    การจัดการหรือการสอบสวนข้อร้องเรียนหรือข้อพิพาทใดๆ
                    การแก้ไขปัญหา การวิเคราะห์ วิจัย และ/หรือจัดทำข้อมูลทางสถิติ
                    เพื่อใช้ในการพัฒนา ปรับปรุงบริการภายในของผู้ให้บริการเอง
                    รวมถึงแต่ไม่จำกัดเพียงการจัดทำแบบจำลอง และ/หรือการศึกษา
                    วิเคราะห์ และติดตามสัดส่วน Portfolio รวม
                  </li>
                  <li className='mt-2 marker:text-gray-400'>
                    การดำเนินงานอื่น ๆ
                    เพื่อการปกป้องคุ้มครองสิทธิอันชอบด้วยกฎหมายของผู้ให้บริการ
                    เช่น การบริหารจัดการความเสี่ยง ในการให้บริการของผู้ให้บริการ
                    การบังคับสิทธิตามกฎหมายหรือตามสัญญารวมถึงแต่ไม่จำกัดเพียง
                    การดำเนินคดีหรือกระบวนการทางกฎหมายที่เกี่ยวข้อง
                    การติดตามการปฏิบัติตามระเบียบภายในบริษัท การบริหารความเสี่ยง
                    การกำกับตรวจสอบภายใน เป็นต้น
                  </li>
                </ul>
              </li>
              <li className='mt-4 laptop:mt-5 marker:text-green-300'>
                <span className='text-green-300'>
                  กรณีได้รับความยินยอมจากผู้ใช้บริการ
                </span>{" "}
                ผู้ให้บริการอาจใช้ข้อมูลส่วนบุคคลของเจ้าของข้อมูลส่วนบุคคล
                ตามจุดประสงค์ที่เจ้าของข้อมูลส่วนบุคคลแต่ละท่านอาจได้
                ให้ความยินยอมเพื่อวัตถุประสงค์เฉพาะ
                ซึ่งอาจรวมถึงแต่ไม่จำกัดเพียง
                <ul className='list-disc'>
                  <li className='mt-2 marker:text-gray-400'>
                    การเก็บรวบรวม ใช้ และ/หรือ
                    เปิดเผยข้อมูลส่วนบุคคลที่ละเอียดอ่อนไหว ได้แก่
                    ภาพจำลองใบหน้าของผู้ใช้บริการหรือบุคคลที่เกี่ยวข้องกับนิติบุคคล
                    ที่ผู้ให้บริการจำเป็นต้องประมวลผลเพื่อการยืนยันตัวตนของผู้ใช้บริการ
                  </li>
                  <li className='mt-2 marker:text-gray-400'>
                    การส่งข้อมูลทางการตลาด ประชาสัมพันธ์
                    การนำส่งข้อเสนอผลิตภัณฑ์ และ/หรือบริการ ของผู้ให้บริการ
                    รวมถึงการนำส่งข่าวสาร
                    คำแนะนำที่เป็นประโยชน์และโปรโมชั่นที่เหมาะสมแก่ผู้ใช้บริการ
                  </li>
                  <div className='mt-4 laptop:mt-5 -ml-5'>
                    ทั้งนี้ในการดำเนินการประมวลผลข้อมูลส่วนบุคคลของเจ้าของข้อมูลส่วนบุคคล
                    ผู้ให้บริการอาจมีความจำเป็นต้องส่งหรือโอนข้อมูลส่วนบุคคลของเจ้าของข้อมูลส่วนบุคคล
                    ไปยังผู้ให้บริการที่อยู่ต่างประเทศ
                    ซึ่งอาจรวมถึงบริษัทในเครือ
                    ในฐานะกรรมการประเมินคุณสมบัติผู้ระดมทุน
                    รวมถึงผู้ให้บริการระบบทางด้านเทคโนโลยีสารสนเทศ
                    หรือผู้ให้บริการระบบคราวด์หรือเซิร์ฟเวอร์ที่ตั้งอยู่ในต่างประเทศ
                    เพื่อประโยชน์ในการปฏิบัติหน้าที่ตามสัญญาที่ผู้ให้บริการอาจมีต่อผู้ใช้บริการ
                    โดยผู้ให้บริการรับประกันการรักษาความปลอดภัยของข้อมูลส่วนบุคคลที่มีการส่งต่อ
                    เปิดเผยหรือโอนไปต่างประเทศให้ได้มาตรฐานตามที่กำหนด ภายใต้
                    พ.ร.บ. คุ้มครองข้อมูลส่วนบุคคล
                  </div>
                </ul>
              </li>
            </ul>
          </div>
          <PrivacyPageContentTitle>
            ระยะเวลาการเก็บข้อมูลส่วนบุคคล
          </PrivacyPageContentTitle>
          <div className='mt-[14px] pl-3 laptop:pl-[29px]'>
            ผู้ให้บริการมีความจำเป็นต้องเก็บรักษาข้อมูลส่วนบุคคลของเจ้าของข้อมูลส่วนบุคคลแต่ละท่านไว้
            (1) ตลอดระยะเวลาที่ผู้ให้บริการมีความจำเป็นในการปฏิบัติสิทธิ
            และหน้าที่เพื่อประโยชน์ของผู้ใช้บริการ (2)
            ตามกรอบระยะเวลาที่กำหนดไว้ภายใต้กฎหมายที่เกี่ยว ข้อง และ (3)
            เพื่อประโยชน์ในการให้บริการและการปกป้อง สิทธิอันชอบด้วยกฎหมาย
            ผุ้ให้บริการสงวนสิทธิเก็บรักษาข้อมูลส่วนบุคคลของผู้ใช้บริการเป็นระยะเวลาสูงสุดตามอายุความที่กำหนดไว้ตามกฎหมาย
          </div>
          <PrivacyPageContentTitle>
            การส่งต่อเปิดเผยข้อมูลของผู้ใช้บริการไปให้แก่บุคคลภายนอก
          </PrivacyPageContentTitle>
          <div className='mt-[14px] pl-3 laptop:pl-[29px]'>
            โดยหลักการ
            ผู้ให้บริการจะเก็บรักษาข้อมูลส่วนบุคคลของเจ้าของข้อมูลส่วนบุคคลเป็นความลับ
            แต่โดยอ้างอิงตามวัตถุประสงค์การประมวลผลข้อมูลส่วนบุคลที่ระบุไว้
            ผู้ให้บริการอาจจำเป็นต้องเปิดเผยข้อมูลส่วนบุคคลเป็นครั้งคราวให้แก่บุคคลภายนอก
            ภายใต้เงื่อนไขที่ผู้ให้บริการจะเปิดเผยข้อมูลส่วนบุคคลเพียงเท่าที่จำเป็น
            ดังต่อไปนี้
            <ul className='list-decimal pl-5 mt-[14px]'>
              <li className='mt-4 laptop:mt-5'>
                ผู้ใช้บริการรายอื่นที่เกี่ยวข้องในกระบวนการออกและเสนอขายหลักทรัพย์คราวด์ฟันดิง
                โดยเฉพาะการเปิดเผยข้อมูลส่วนบุคคลของบุคคลที่เกี่ยวข้องของผู้ระดมทุนให้แก่
                ผู้ลงทุนเพื่อการพิจารณาการลงทุน
                และการเปิดเผยข้อมูลส่วนบุคคลของผู้ลงทุน ให้แก่ผู้ระดมทุน
                เพื่อการจัดทำและส่งมอบหลักทรัพย์คราวด์ฟันดิง
                และการติดต่อประสานงานระหว่างกันเพื่อการปฏิบัติธุรกรรมภายใต้เอกสารการเสนอขายหลักทรัพย์คราวด์ฟันดิงและเอกสารข้อกำหนดสิทธิที่เกี่ยวข้อง
              </li>
              <li className='mt-4 laptop:mt-5'>
                ผู้ให้บริการที่เป็นบุคคลภายนอก
                ที่ให้บริการสนับสนุนการให้บริการของผู้ให้บริการ
                ซึ่งอาจรวมถึงแต่ไม่จำกัดเพียง ผู้ให้บริการฐานข้อมูล
                ทั้งภาครัฐและเอกชน ธนาคารผู้เก็บรักษาทรัพย์สิน
                ผู้ให้บริการระบบเทคโนโลยีสารสนเทศ
                ผู้ให้บริการการชำระเงินและการจัดทำบัญชี หรือที่ปรึกษา
                เพื่อการดำเนินธุรกิจ และการทำงานของแพลตฟอร์ม
                หรือบริการอื่นใดของผู้ให้บริการ
              </li>
              <li className='mt-4 laptop:mt-5'>
                หน่วยงานราชการ โดยเฉพาะสำนักงาน
                คณะกรรมการกำกับหลักทรัพย์และตลาดหลักทรัพย
                ที่ผู้ให้บริการมีหน้าที่จำเป็นต้องเปิดเผยข้อมูล
                ตามกฎหมายและข้อบังคับที่มีผลบังคับใช้ รวมถึงการเปิดเผยต่อศาล
                อนุญาโตตุลาการ และ/หรือ หน่วยงานของรัฐด้านกฎหมาย ระเบียบ
                ข้อบังคับ
              </li>
              <li className='mt-4 laptop:mt-5'>
                บุคคลภายนอกอื่นใด ที่เจ้าของข้อมูลส่วนบุคคล
                และ/หรือผู้ใช้บริการแจ้งความยินยอมแก่ผู้ให้บริการ
                ในการเปิดเผยข้อมูลให้แก่บุคคลเหล่านั้น
              </li>
            </ul>
          </div>
          <PrivacyPageContentTitle>
            มาตรการรักษาความลับของข้อมูลส่วนบุคคล
          </PrivacyPageContentTitle>
          <div className='mt-[14px] pl-3 laptop:pl-[29px]'>
            เพื่อให้การรักษาความปลอดภัยสำหรับข้อมูลส่วนบุคคลของเจ้าของข้อมูล
            ผู้ให้บริการกำหนดนโยบายควบคุมข้อมูลและนโยบายรักษาความลับ ความถูกต้อง
            และความพร้อมใช้ของข้อมูลส่วนบุคคลทั้งหมดที่ผู้ให้บริการอาจจำเป็นต้องประมวลผล
            โดยมีการกำหนดสิทธิและข้อจำกัดสิทธิในการเข้าถึงข้อมูลส่วนบุคคล
            การเปิดเผยและการดำเนินการเกี่ยวกับข้อมูลส่วนบุคคลที่จำเป็น
            พร้อมทั้งมีการกำหนดมาตรการรักษาความมั่นคงปลอดภัยของระบบ
            และข้อมูลส่วนบุคคลเพิ่มเติม
            เพื่อปกป้องข้อมูลส่วนบุคคลทั้งหมดจากการถูกทำลายหรือบุกรุกจากผู้ไม่หวังดี
            หรือผู้ที่ไม่มีสิทธิในการเข้าถึงข้อมูล
            โดยใช้มาตรฐานการรักษาความปลอดภัยของข้อมูล ขั้นสูง
            และผู้ให้บริการกำหนดให้มีการตรวจสอบและประเมินความเสี่ยงด้านความมั่นคงปลอดภัยของระบบงานอย่างสม่ำเสมอ
            อย่างน้อยปีละครั้ง รวมถึงการจัดให้มีการสำรองข้อมูลที่เหมาะสม
            เพื่อสร้างความเชื่อมั่นในการให้บริการ
          </div>
          <PrivacyPageContentTitle>
            สิทธิของเจ้าของข้อมูลส่วนบุคคล
          </PrivacyPageContentTitle>
          <div className='mt-[14px] pl-3 laptop:pl-[29px]'>
            ผู้ให้บริการเคารพสิทธิของเจ้าของข้อมูลส่วนบุคคล
            ในสิทธิตามกฎหมายเหนือข้อมูลส่วนบุคคลของท่านที่อยู่ภายใต้การคุ้มครองของผู้ให้บริการ
            ดังนั้น
            ผู้ให้บริการเปิดให้เจ้าของข้อมูลส่วนบุคคลสามารถขอใช้สิทธิต่าง ๆ
            ได้ภายใต้ข้อกำหนดของกฎหมาย ซึ่งสิทธิดังกล่าวได้แก่ (1)
            สิทธิขอถอนความยินยอม: เมื่อใดก็ได้ตลอดระยะเวลา
            แต่การถอนความยินยอมนั้นจะไม่ส่งผลกระทบต่อการเก็บรวบรวม ใช้
            และ/หรือเปิดเผยข้อมูลส่วนบุคคลที่ได้กระทำขึ้นก่อนการถอนความยินยอม
            (2) สิทธิขอเข้าถึงข้อมูล (3) สิทธิขอถ่ายโอนข้อมูล
            ในกรณีที่ผู้ให้บริการได้จัดทำข้อมูลส่วนบุคคลนั้นอยู่ในรูปแบบให้สามารถอ่านหรือใช้งานได้ด้วยเครื่องมือหรืออุปกรณ์ที่ทำงาน
            ได้โดยอัตโนมัติ เว้นแต่ไม่สามารถดำเนินการได้เพราะเหตุทางเทคนิค (4)
            สิทธิขอคัดค้านการประมวลผล (5) สิทธิขอให้ลบหรือทำลายข้อมูล
            หรือทำให้ข้อมูลส่วนบุคคลเป็นข้อมูล
            ที่ไม่สามารถระบุตัวได้หากผู้ให้บริการหมดความจำเป็นในการเก็บรักษาไว้ตามวัตถุประสงค์ที่เกี่ยวข้องในนโยบายฉบับนี้
            (6) สิทธิขอให้ระงับการใช้ข้อมูลในกรณีที่อยู่ระหว่าง
            ตรวจสอบตามคำร้องขอใช้สิทธิขอแก้ไขข้อมูลส่วนบุคคลหรือขอคัดค้าน
            หรือเป็นกรณีที่เป็นข้อมูลส่วนบุคคลที่ต้องลบหรือทำลาย (7)
            สิทธิขอให้แก้ไขข้อมูลส่วนบุคคล ของผู้ใช้บริการ ให้ถูกต้อง
            เป็นปัจจุบัน สมบูรณ์ และไม่ก่อให้เกิดความเข้าใจผิด หรือ (8)
            สิทธิร้องเรียนต่อผู้มีอำนาจตามกฎหมายที่เกี่ยวข้อง
            หากเจ้าของข้อมูลส่วนบุคคลเชื่อว่า การเก็บรวบรวม ใช้ และ/หรือ
            เปิดเผยข้อมูลส่วนบุคคลของท่านเป็นการกระทำในลักษณะที่ฝ่าฝืน
            หรือไม่ปฏิบัติตามกฎหมายที่เกี่ยวข้อง
          </div>
          <PrivacyPageContentTitle>
            ข้อมูลติดต่อผู้ให้บริการในฐานะผู้ควบคุมข้อมูลส่วนบุคคล
          </PrivacyPageContentTitle>
          <div className='mt-[14px] pl-3 laptop:pl-[29px]'>
            บริษัท อินเวสทรี (ไทยแลนด์) จำกัด อาคาร เลค รัชดา ออฟฟิส คอมเพล็กซ์
            ชั้น 12 ห้อง B เลขที่ 195/13 ถนนรัชดาภิเษก แขวงคลองเตย เขตคลองเตย
            กรุงเทพมหานคร ประเทศไทย 10110 โทรศัพท์: 02-258-6589
          </div>
          <div className='mt-[14px] pl-3 laptop:pl-[29px]'>
            เจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคล: dpo@investree.co.th
          </div>
        </div>
      </div>
    </Layout>
  );
};

export default PrivacyPolicyPage;

export const getStaticProps = async ({ locale }: ILocaleProps) => {
  return {
    props: {
      messages: (await import(`../../../messages/${locale}.json`)).default,
    },
  };
};
